yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
/* wolf_main.c
 *
 * Copyright (C) 2006-2026 wolfSSL Inc.
 *
 * This file is part of wolfSSL.
 *
 * wolfSSL is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfSSL is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

/* Bare-metal entry point and board support for the wolfCrypt test/benchmark
 * on the TI LAUNCHXL-F28P55X (TMS320F28P550SJ, C2000 C28x DSP).
 *
 * Output: by default printf goes to the CCS console over JTAG (CIO), which
 * needs no wiring - good for first light.  Define WOLF_C2000_SCI_STDOUT to
 * route stdout to SCIA (GPIO28/29), the XDS110 virtual COM, at 115200 8N1 for
 * headless runs.
 *
 * The C28x has no hardware TRNG, so my_rng_seed_gen() is a DEV-ONLY counter
 * seed - NOT secure.  ML-DSA verify and the hash tests are deterministic and
 * do not consume it.
 */

#include "driverlib.h"
#include "device.h"

#include <stdio.h>
#include <stddef.h>
#ifdef WOLF_C2000_SCI_STDOUT
#include <file.h>
#endif

#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/sha256.h>
#include <wolfssl/wolfcrypt/sha512.h>
#ifdef WOLF_SHA1
#include <wolfssl/wolfcrypt/sha.h>
#endif
#include <wolfssl/wolfcrypt/sha3.h>
#include <wolfssl/wolfcrypt/wc_mldsa.h>
#ifdef WOLF_MLKEM
#include <wolfssl/wolfcrypt/wc_mlkem.h>
#endif
#ifdef WOLF_AES
#include <wolfssl/wolfcrypt/aes.h>
#endif
#ifdef WOLF_HWAES
#include <wolfssl/wolfcrypt/port/ti/ti-c2000.h>
#endif
#ifdef WOLF_ENTROPY
#include <wolfssl/wolfcrypt/port/ti/ti-c2000-entropy.h>
#endif
#ifdef WOLF_ENTROPY_PROBE
#include "entropy_probe.h"
#endif
#ifdef WOLF_25519
#include <wolfssl/wolfcrypt/curve25519.h>
#include <wolfssl/wolfcrypt/ed25519.h>
#include <wolfssl/wolfcrypt/random.h>
#endif
#ifdef WOLF_448
#include <wolfssl/wolfcrypt/curve448.h>
#include <wolfssl/wolfcrypt/ed448.h>
#endif
#ifdef WOLF_HKDF
#include <wolfssl/wolfcrypt/hmac.h>
#include <wolfssl/wolfcrypt/kdf.h>
#endif
#ifdef WOLF_CHACHA
#include <wolfssl/wolfcrypt/chacha20_poly1305.h>
#endif
#ifdef WOLF_AESEXTRA
#include <wolfssl/wolfcrypt/aes.h>
#include <wolfssl/wolfcrypt/cmac.h>
#endif
#ifdef WOLF_RSA
#include <wolfssl/wolfcrypt/rsa.h>
#include <wolfssl/wolfcrypt/asn_public.h>
#include <wolfssl/wolfcrypt/random.h>
#endif
#ifdef WOLF_DH
#include <wolfssl/wolfcrypt/dh.h>
#endif
#ifdef WOLF_RSASIGN
#include <wolfssl/wolfcrypt/rsa.h>
#include "rsa2048_priv.h"
#endif
#ifdef WOLF_ECC
#include <wolfssl/wolfcrypt/ecc.h>
#include <wolfssl/wolfcrypt/random.h>
#include <wolfssl/wolfcrypt/integer.h>
#endif
#include <wolfcrypt/test/test.h>
#include <wolfcrypt/benchmark/benchmark.h>
#if defined(WOLF_MLDSA_OCTETS) || defined(WOLF_SECUREBOOT)
/* The octet-boundary image carries its own seed-derived vectors for all three
 * parameter sets (it needs the matching private key to produce the pre-hash
 * signatures), and reuses the same kat_mldsa87_* names.  The canonical FIPS 204
 * ML-DSA-87 vectors from wolfcrypt/test/test.c stay in the default image. */
#include <wolfssl/wolfcrypt/hash.h>
#include "mldsa_octet_kat.h"
#ifdef WOLFSSL_MLDSA_VERIFY_PRECOMP_A
#include "mldsa87_precomp_a.h"
#endif
#else
#include "mldsa87_kat.h"
#endif
#ifdef WOLF_ECC
#include "ecc_p256_kat.h"
#endif
#ifdef WOLF_RSA
#include "rsa2048_kat.h"
#endif

/* ------------------------------------------------------------------------- */
/* SCIA console (XDS110 virtual COM)                                         */
/* ------------------------------------------------------------------------- */
static void c2000_sciInit(void)
{
    /* RX pin */
    GPIO_setPinConfig(DEVICE_GPIO_CFG_SCIRXDA);
    GPIO_setDirectionMode(DEVICE_GPIO_PIN_SCIRXDA, GPIO_DIR_MODE_IN);
    GPIO_setPadConfig(DEVICE_GPIO_PIN_SCIRXDA, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(DEVICE_GPIO_PIN_SCIRXDA, GPIO_QUAL_ASYNC);

    /* TX pin */
    GPIO_setPinConfig(DEVICE_GPIO_CFG_SCITXDA);
    GPIO_setDirectionMode(DEVICE_GPIO_PIN_SCITXDA, GPIO_DIR_MODE_OUT);
    GPIO_setPadConfig(DEVICE_GPIO_PIN_SCITXDA, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(DEVICE_GPIO_PIN_SCITXDA, GPIO_QUAL_ASYNC);

    SCI_performSoftwareReset(SCIA_BASE);
    SCI_setConfig(SCIA_BASE, DEVICE_LSPCLK_FREQ, 115200,
                  (SCI_CONFIG_WLEN_8 | SCI_CONFIG_STOP_ONE | SCI_CONFIG_PAR_NONE));
    SCI_resetChannels(SCIA_BASE);
    SCI_resetRxFIFO(SCIA_BASE);
    SCI_resetTxFIFO(SCIA_BASE);
    SCI_enableFIFO(SCIA_BASE);
    SCI_enableModule(SCIA_BASE);
    SCI_performSoftwareReset(SCIA_BASE);
}

/* RAM capture buffer: every stdout byte is mirrored here so the host can read
 * program output back over JTAG (symbol g_log / g_logpos), independent of SCI
 * routing or CIO.  Lives in .bss (RAM); survives a warm reset.  The log only
 * ever holds a few KB of text, so the RAM-tight builds get the small size. */
#if defined(WOLF_MLDSA_SIGN) || defined(WOLF_MLKEM)
    /* RAM-tight: the ML-DSA sign and ML-KEM-768 builds need the RAM for their
     * large key/poly state, so the capture buffer shrinks. */
    #define WOLF_LOG_SZ 2048
#else
    /* Everything else has RAM to spare: capture the whole run. */
    #define WOLF_LOG_SZ 12288
#endif
volatile char          g_log[WOLF_LOG_SZ];
volatile unsigned long g_logpos = 0;

#ifdef WOLF_STACK_PROFILE
/* Stack high-water profiling.  The C28x SP grows UP from the base of the .stack
 * section; paint the as-yet-unused upper stack with a sentinel just before the
 * call, then scan from the top down afterwards to find the deepest address
 * touched.  Bounds come from the TI linker (__stack / __TI_STACK_END) so this
 * is correct for both the verify (16 KW) and sign (12 KW) stack windows. */
extern unsigned int __stack;        /* .stack low address  (TI linker) */
extern unsigned int __TI_STACK_END; /* .stack high address (TI linker) */
#define WOLF_STK_BASE ((unsigned long)(&__stack))
#define WOLF_STK_TOP  ((unsigned long)(&__TI_STACK_END))
volatile unsigned long g_stk_paint = 0; /* address paint started from   */
volatile unsigned long g_stk_peak  = 0; /* highest address left touched */
static void wolf_paint_stack(void)
{
    unsigned int  marker;
    unsigned int* p   = &marker + 8;                  /* just above this frame */
    unsigned int* top = (unsigned int*)WOLF_STK_TOP;
    g_stk_paint = (unsigned long)&marker;
    while (p < top) {
        *p = 0xCCCCU;
        p++;
    }
}
static void wolf_measure_stack(void)
{
    unsigned int* p    = (unsigned int*)(WOLF_STK_TOP - 1UL);
    unsigned int* base = (unsigned int*)WOLF_STK_BASE;
    while ((p > base) && (*p == 0xCCCCU)) {
        p--;
    }
    g_stk_peak = (unsigned long)p;
}
#endif /* WOLF_STACK_PROFILE */

