yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
#ifdef WOLF_MEM_PROFILE
/* Heap high-water tracking.  Installed via wolfSSL_SetAllocators() so every
 * XMALLOC/XFREE/XREALLOC routes through here.  Each block is prefixed with its
 * cell count so free/realloc can adjust the running total.  Counts are in
 * 16-bit cells; x2 gives octets.  The 1-prefix per allocation is a small,
 * noted overhead. */
#include <stdlib.h>
#include <wolfssl/wolfcrypt/memory.h>
volatile unsigned long g_heap_cur  = 0;
volatile unsigned long g_heap_peak = 0;
static void wolf_heap_reset(void)
{
    g_heap_cur  = 0;
    g_heap_peak = 0;
}
static void* wolf_prof_malloc(size_t n)
{
    size_t* p;
    if (n == 0) {
        n = 1;
    }
    p = (size_t*)malloc(n + sizeof(size_t));
    if (p == NULL) {
        return NULL;
    }
    p[0] = n;
    g_heap_cur += (unsigned long)n;
    if (g_heap_cur > g_heap_peak) {
        g_heap_peak = g_heap_cur;
    }
    return (void*)(p + 1);
}
static void wolf_prof_free(void* ptr)
{
    size_t* p;
    if (ptr == NULL) {
        return;
    }
    p = ((size_t*)ptr) - 1;
    g_heap_cur -= (unsigned long)p[0];
    free(p);
}
static void* wolf_prof_realloc(void* ptr, size_t n)
{
    size_t* p;
    size_t  old;
    void*   nw;
    if (ptr == NULL) {
        return wolf_prof_malloc(n);
    }
    p   = ((size_t*)ptr) - 1;
    old = p[0];
    nw  = wolf_prof_malloc(n);
    if (nw != NULL) {
        XMEMCPY(nw, ptr, (old < n) ? old : n);
        wolf_prof_free(ptr);
    }
    return nw;
}
static void wolf_mem_install(void)
{
    (void)wolfSSL_SetAllocators(wolf_prof_malloc, wolf_prof_free,
                                wolf_prof_realloc);
}
/* Bracket an operation: reset the heap counter + paint the stack, then after
 * the call report the stack high-water and heap peak in octets. */
#define MEMPROF_BEGIN()      do { wolf_heap_reset(); wolf_paint_stack(); } \
                             while (0)
#define MEMPROF_END(nm, op)  do { wolf_measure_stack(); \
    printf("MEMPROF %s %s: stack=%lu octets, heap_peak=%lu octets\r\n", \
        (nm), (op), (g_stk_peak - WOLF_STK_BASE + 1UL) * 2UL, \
        g_heap_peak * 2UL); } while (0)
#else
#define MEMPROF_BEGIN()      do { } while (0)
#define MEMPROF_END(nm, op)  do { } while (0)
#endif /* WOLF_MEM_PROFILE */

static void wolf_logbyte(char c)
{
    if (g_logpos < (unsigned long)sizeof(g_log)) {
        g_log[g_logpos++] = c;
    }
}

#ifdef WOLF_C2000_SCI_STDOUT
/* Minimal CGT low-level I/O device that writes to SCIA, so printf/stdout can
 * be redirected with add_device()/freopen().  Only write() does real work. */
int    WOLF_open(const char *path, unsigned flags, int llv_fd);
int    WOLF_close(int dev_fd);
int    WOLF_read(int dev_fd, char *buf, unsigned count);
int    WOLF_write(int dev_fd, const char *buf, unsigned count);
fpos_t WOLF_lseek(int dev_fd, fpos_t offset, int origin);
int    WOLF_unlink(const char *path);
int    WOLF_rename(const char *old_name, const char *new_name);

int WOLF_open(const char *path, unsigned flags, int llv_fd)
{
    (void)path;
    (void)flags;
    (void)llv_fd;
    return 0;
}

int WOLF_close(int dev_fd)
{
    (void)dev_fd;
    return 0;
}

int WOLF_read(int dev_fd, char *buf, unsigned count)
{
    (void)dev_fd;
    (void)buf;
    (void)count;
    return 0;
}

int WOLF_write(int dev_fd, const char *buf, unsigned count)
{
    unsigned i;
    (void)dev_fd;
    for (i = 0; i < count; i++) {
        wolf_logbyte(buf[i]);
        if (buf[i] == '\n') {
            SCI_writeCharBlockingFIFO(SCIA_BASE, (uint16_t)'\r');
        }
        SCI_writeCharBlockingFIFO(SCIA_BASE, (uint16_t)(buf[i] & 0xFF));
    }
    return (int)count;
}

fpos_t WOLF_lseek(int dev_fd, fpos_t offset, int origin)
{
    (void)dev_fd;
    (void)offset;
    (void)origin;
    return (fpos_t)0;
}

int WOLF_unlink(const char *path)
{
    (void)path;
    return 0;
}

int WOLF_rename(const char *old_name, const char *new_name)
{
    (void)old_name;
    (void)new_name;
    return 0;
}

static void c2000_stdoutToSci(void)
{
    add_device("wolf", _SSA, WOLF_open, WOLF_close, WOLF_read, WOLF_write,
               WOLF_lseek, WOLF_unlink, WOLF_rename);
    freopen("wolf:", "w", stdout);
    setvbuf(stdout, NULL, _IONBF, 0); /* unbuffered: lines appear promptly */
}
#endif /* WOLF_C2000_SCI_STDOUT */

/* ------------------------------------------------------------------------- */
/* Benchmark time source - free-running CPU Timer 0 at SYSCLK                 */
/* ------------------------------------------------------------------------- */
static void c2000_timerInit(void)
{
    CPUTimer_stopTimer(CPUTIMER0_BASE);
    CPUTimer_setPeriod(CPUTIMER0_BASE, 0xFFFFFFFFUL);
    CPUTimer_setPreScaler(CPUTIMER0_BASE, 0U);
    CPUTimer_setEmulationMode(CPUTIMER0_BASE,
                              CPUTIMER_EMULATIONMODE_RUNFREE);
    CPUTimer_reloadTimerCounter(CPUTIMER0_BASE);
    CPUTimer_startTimer(CPUTIMER0_BASE);
}

/* benchmark.c (WOLFSSL_USER_CURRTIME) calls this for elapsed seconds.
 * CPU Timer 0 is a 32-bit down-counter that auto-reloads from 0xFFFFFFFF; we
 * accumulate in 64 bits across reloads.  NOTE: a single measured interval must
 * be shorter than 2^32 / SYSCLK (~28.6 s at 150 MHz) for the wrap handling to
 * be exact - true for all BENCH_EMBEDDED cases here. */
double current_time(int reset)
{
    static unsigned long long accum = 0;
    static uint32_t last = 0;
    static int started = 0;
    uint32_t now;

    now = CPUTimer_getTimerCount(CPUTIMER0_BASE);

    if (!started || reset) {
        accum = 0;
        last = now;
        started = 1;
        return 0.0;
    }

    if (last >= now) {
        accum += (unsigned long long)(last - now);
    }
    else {
        /* counter reloaded once since the last sample */
        accum += (unsigned long long)last +
                 (0xFFFFFFFFULL - (unsigned long long)now) + 1ULL;
    }
    last = now;

    return (double)accum / (double)DEVICE_SYSCLK_FREQ;
}

#ifdef WOLF_MLKEM
/* Dump head bytes + ".." + tail bytes of a buffer as hex, matching the host
 * reference dumper, to localize a CHAR_BIT==16 divergence. */
static void kem_dump(const char* name, const byte* b, int len, int head,
                     int tail)
{
    int i;
    printf("%s[%d]: ", name, len);
    for (i = 0; i < head && i < len; i++) {
        printf("%02x", (unsigned)(b[i] & 0xFF));
    }
    if (len > head + tail) {
        printf("..");
        for (i = len - tail; i < len; i++) {
            printf("%02x", (unsigned)(b[i] & 0xFF));
        }
    }
    printf("\r\n");
}

