yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
#ifdef WOLF_SHA1
static void wolf_sha1_test(void)
{
    /* SHA-1("abc") = a9993e36 4706816a ba3e2571 7850c26c 9cd0d89d */
    static const byte sha1_in[3] = { 0x61, 0x62, 0x63 };
    static const byte sha1_exp[WC_SHA_DIGEST_SIZE] = {
        0xa9,0x99,0x3e,0x36,0x47,0x06,0x81,0x6a,0xba,0x3e,
        0x25,0x71,0x78,0x50,0xc2,0x6c,0x9c,0xd0,0xd8,0x9d };
    wc_Sha sha1;
    byte sha1o[WC_SHA_DIGEST_SIZE];
    int s1ok = 1, si;
    if (wc_InitSha(&sha1) == 0) {
        (void)wc_ShaUpdate(&sha1, sha1_in, sizeof(sha1_in));
        (void)wc_ShaFinal(&sha1, sha1o);
        wc_ShaFree(&sha1);
        for (si = 0; si < WC_SHA_DIGEST_SIZE; si++) {
            if (sha1o[si] != sha1_exp[si]) { s1ok = 0; }
        }
        printf("SHA-1(abc) KAT: %s\r\n", s1ok ? "PASS" : "FAIL");
    }
}
#endif /* WOLF_SHA1 */

#if !defined(WOLF_MLDSA_SIGN) && !defined(WOLF_MLDSA_OCTETS) && \
    !defined(WOLF_SECUREBOOT)
/* ML-DSA-87 verify known-answer test (real pk/msg/sig from test.c).  This
 * is the primary deliverable: a deterministic, RNG-free verify on HW.
 * Key struct is static (large; WOLFSSL_MLDSA_VERIFY_NO_MALLOC pins buffers
 * into it). msg matches test.c's mldsa_param_vfy_test: msg[i] = (byte)i.
 * Skipped in the SIGN build: its static verify key would not fit alongside
 * the sign key + 32 KW heap, and the sign round-trip below also exercises
 * verify (of a freshly produced signature).  Skipped in the SECUREBOOT build
 * too: that image calls wolf_secureboot_test() instead, so the guard here has
 * to match the call site or this is compiled and never used. */
static void wolf_mldsa87_verify_test(void)
{
    /* mldsa_key is static (.bss): WOLFSSL_MLDSA_VERIFY_NO_MALLOC pins the
     * verify workspace inside it, which is far too large for the 16 KW C28x
     * stack.  md_msg, by contrast, is deliberately left on the stack - it is
     * only 512 cells and it keeps the WOLF_STACK_PROFILE figure below a
     * true end-to-end measurement of the verify path. */
    static wc_MlDsaKey mldsa_key;
    byte md_msg[512];
    int  md_i;
    int  md_res = 0;
    int  md_ret;
#ifdef WOLF_MLDSA_VERIFY_BENCH
    int    bi;
    int    br = 0;
    double t;
#endif

    /* test.c builds this as msg[i] = (byte)i.  On an 8-bit-byte host that
     * wraps mod 256; a wolfCrypt 'byte' buffer must hold octet values, so
     * mask explicitly (a C28x 'byte' is a 16-bit cell and would otherwise
     * store 256..511 verbatim, corrupting the octet-wise hash input). */
    for (md_i = 0; md_i < (int)sizeof(md_msg); md_i++) {
        md_msg[md_i] = (byte)(md_i & 0xFF);
    }
    md_ret = wc_MlDsaKey_Init(&mldsa_key, NULL, INVALID_DEVID);
    if (md_ret == 0) {
        md_ret = wc_MlDsaKey_SetParams(&mldsa_key, WC_ML_DSA_87);
    }
    if (md_ret == 0) {
        md_ret = wc_MlDsaKey_ImportPubRaw(&mldsa_key, kat_mldsa87_pub,
            (word32)sizeof(kat_mldsa87_pub));
    }
    if (md_ret == 0) {
#ifdef WOLF_MEM_PROFILE
        wolf_heap_reset();
#endif
#ifdef WOLF_STACK_PROFILE
        wolf_paint_stack();
#endif
        md_ret = wc_MlDsaKey_VerifyCtx(&mldsa_key, kat_mldsa87_sig,
            (word32)sizeof(kat_mldsa87_sig), NULL, 0, md_msg,
            (word32)sizeof(md_msg), &md_res);
#ifdef WOLF_STACK_PROFILE
        wolf_measure_stack();
#endif
    }
    printf("ML-DSA-87 verify KAT: %s (ret=%d res=%d)\r\n",
           (md_ret == 0 && md_res == 1) ? "PASS" : "FAIL", md_ret, md_res);
#ifdef WOLF_MLDSA_VERIFY_BENCH
    /* Time the deterministic verify (CPU Timer 0 via current_time); 10 ops
     * keeps the interval under the ~28 s single-measurement wrap. */
    if ((md_ret == 0) && (md_res == 1)) {
        (void)current_time(1);
        for (bi = 0; bi < 10; bi++) {
            (void)wc_MlDsaKey_VerifyCtx(&mldsa_key, kat_mldsa87_sig,
                (word32)sizeof(kat_mldsa87_sig), NULL, 0, md_msg,
                (word32)sizeof(md_msg), &br);
        }
        t = current_time(0);
        printf("ML-DSA-87 verify bench: 10 ops in %.3f s = %.2f ms/op, "
               "%.2f ops/sec\r\n", t, (t * 1000.0) / 10.0, 10.0 / t);
    }
#endif
#ifdef WOLF_STACK_PROFILE
    printf("ML-DSA-87 verify: stack peak=0x%lx used=%lu words (key struct "
           "sizeof=%lu words); heap: VERIFY_NO_MALLOC\r\n",
           g_stk_peak, (g_stk_peak - WOLF_STK_BASE + 1UL),
           (unsigned long)sizeof(mldsa_key));
#endif
#ifdef WOLF_MEM_PROFILE
    printf("MEMPROF ML-DSA-87 verify: stack=%lu octets, heap_peak=%lu "
           "octets, key_sizeof=%lu octets\r\n",
           (g_stk_peak - WOLF_STK_BASE + 1UL) * 2UL, g_heap_peak * 2UL,
           (unsigned long)sizeof(mldsa_key) * 2UL);
#endif
    wc_MlDsaKey_Free(&mldsa_key);
}
#endif /* !WOLF_MLDSA_SIGN && !WOLF_MLDSA_OCTETS */

#ifdef WOLF_MLDSA_OCTETS
/* ------------------------------------------------------------------------- */
/* ML-DSA octet-boundary tests (make MLDSA=1)                                */
/* ------------------------------------------------------------------------- */
/* Proves three things on 16-bit-byte silicon: verify is correct at all three
 * parameter sets (level 44 matters most - its w1 encoder packs 6-bit values, so
 * it is the only one that can push a cell above 255); the HashML-DSA path
 * wc_MlDsaKey_VerifyCtxHash() works with a non-empty context; and a key and
 * signature that arrive PACKED verify once wc_UnpackOctets() expands them.
 * One key struct is shared - WOLFSSL_MLDSA_VERIFY_NO_MALLOC pins the verify
 * workspace inside it, far too big for the 16 KW C28x stack. */
/* Static: an ML-DSA-65 signature is 3309 octets = 3309 cells = 6618 bytes. */
static byte     mo_pub[WC_MLDSA_65_PUB_KEY_SIZE];
static byte     mo_sig[WC_MLDSA_65_SIG_SIZE];
static wc_MlDsaKey mo_key;
static byte     mo_msg[512];

/* hashAlg < 0 selects plain verify over the message; otherwise pre-hash. */
static void mo_verify(const char* what, int type, const byte* pub,
    word32 pubLen, const byte* sig, word32 sigLen, int hashAlg,
    const byte* hash, word32 hashLen)
{
    int res = 0;
    int ret;

