yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    ret = wc_MlDsaKey_Init(&mo_key, NULL, INVALID_DEVID);
    if (ret == 0) {
        ret = wc_MlDsaKey_SetParams(&mo_key, type);
    }
    if (ret == 0) {
        ret = wc_MlDsaKey_ImportPubRaw(&mo_key, pub, pubLen);
    }
    if (ret == 0) {
        if (hashAlg < 0) {
            ret = wc_MlDsaKey_VerifyCtx(&mo_key, sig, sigLen, NULL, 0, mo_msg,
                (word32)sizeof(mo_msg), &res);
        }
        else {
            ret = wc_MlDsaKey_VerifyCtxHash(&mo_key, sig, sigLen,
                (const byte*)KAT_MLDSA_CTX,
                (byte)(sizeof(KAT_MLDSA_CTX) - 1), hash, hashLen, hashAlg,
                &res);
        }
    }
    printf("%s %s (ret=%d res=%d)\r\n", what,
           ((ret == 0) && (res == 1)) ? "PASS" : "FAIL", ret, res);
    wc_MlDsaKey_Free(&mo_key);
}

/* Helpers on their own, odd length so the partial trailing cell is covered. */
static void mo_pack_roundtrip(void)
{
    byte src[65];
    byte packed[65];
    byte back[65];
    int  i;
    int  ret;
    int  ok;

    for (i = 0; i < (int)sizeof(src); i++) {
        src[i] = (byte)((i * 7 + 1) & 0xFF);
    }
    ret = wc_PackOctets(packed, (word32)sizeof(packed), src,
        (word32)sizeof(src), (word32)sizeof(src));
    if (ret == 0) {
        ret = wc_UnpackOctets(back, (word32)sizeof(back), packed,
            (word32)sizeof(packed), (word32)sizeof(src));
    }
    /* Round-trip alone would also pass for an identity implementation, so
     * check the packed layout itself: cell 0 must carry the first
     * WC_OCTETS_PER_BYTE octets, low octet first. */
    ok = (ret == 0) && (XMEMCMP(src, back, sizeof(src)) == 0);
    if (ok) {
        word32 expect = 0;
        word32 e;
        for (e = 0; e < WC_OCTETS_PER_BYTE; e++) {
            expect |= (word32)src[e] << (8 * e);
        }
        ok = ((word32)packed[0] == expect);
    }
    printf("wc_Pack/UnpackOctets round-trip: %s (ret=%d)\r\n",
           ok ? "PASS" : "FAIL", ret);
}

/* Key and signature stored PACKED, expanded before use. */
static void mo_packed_verify(void)
{
    int res = 0;
    int ret;

    ret = wc_UnpackOctets(mo_pub, (word32)sizeof(mo_pub),
        (const byte*)kat_mldsa65_pub_packed,
        (word32)(sizeof(kat_mldsa65_pub_packed) /
                 sizeof(kat_mldsa65_pub_packed[0])),
        (word32)sizeof(mo_pub));
    if (ret == 0) {
        ret = wc_UnpackOctets(mo_sig, (word32)sizeof(mo_sig),
            (const byte*)kat_mldsa65_sig_packed,
            (word32)(sizeof(kat_mldsa65_sig_packed) /
                     sizeof(kat_mldsa65_sig_packed[0])),
            (word32)sizeof(mo_sig));
    }
    /* Expanded buffers must match the plain arrays octet for octet. */
    if (ret == 0) {
        if ((XMEMCMP(mo_pub, kat_mldsa65_pub, sizeof(mo_pub)) != 0) ||
            (XMEMCMP(mo_sig, kat_mldsa65_sig, sizeof(mo_sig)) != 0)) {
            ret = -1;
        }
    }
    if (ret == 0) {
        ret = wc_MlDsaKey_Init(&mo_key, NULL, INVALID_DEVID);
    }
    if (ret == 0) {
        ret = wc_MlDsaKey_SetParams(&mo_key, WC_ML_DSA_65);
    }
    if (ret == 0) {
        ret = wc_MlDsaKey_ImportPubRaw(&mo_key, mo_pub, (word32)sizeof(mo_pub));
    }
    if (ret == 0) {
        ret = wc_MlDsaKey_VerifyCtx(&mo_key, mo_sig, (word32)sizeof(mo_sig),
            NULL, 0, mo_msg, (word32)sizeof(mo_msg), &res);
    }
    printf("ML-DSA-65 packed-signature verify: %s (ret=%d res=%d)\r\n",
           ((ret == 0) && (res == 1)) ? "PASS" : "FAIL", ret, res);
    wc_MlDsaKey_Free(&mo_key);
}

static void wolf_mldsa_octet_test(void)
{
    byte sha256[WC_SHA256_DIGEST_SIZE];
    byte sha512[WC_SHA512_DIGEST_SIZE];
    int  i;
    int  ret;

    /* msg[i] = i & 0xFF.  The mask is not cosmetic here: a C28x cell would
     * otherwise store 256..511 verbatim and corrupt the hash input. */
    for (i = 0; i < (int)sizeof(mo_msg); i++) {
        mo_msg[i] = (byte)(i & 0xFF);
    }
    ret = wc_Sha256Hash(mo_msg, (word32)sizeof(mo_msg), sha256);
    if (ret == 0) {
        ret = wc_Sha512Hash(mo_msg, (word32)sizeof(mo_msg), sha512);
    }
    if (ret != 0) {
        printf("ML-DSA octet tests: SKIP (digest failed ret=%d)\r\n", ret);
        return;
    }

    printf("octet model: CHAR_BIT=%d, one octet per byte cell, %lu octet(s) "
           "per cell when packed; ML-DSA-65 sig = %lu octets = %lu cells = "
           "%lu bytes of RAM\r\n",
           (int)CHAR_BIT, (unsigned long)WC_OCTETS_PER_BYTE,
           (unsigned long)WC_MLDSA_65_SIG_SIZE,
           (unsigned long)WC_MLDSA_65_SIG_SIZE,
           (unsigned long)WC_MLDSA_65_SIG_SIZE * (CHAR_BIT / 8));

    mo_pack_roundtrip();

    mo_verify("ML-DSA-44 verify KAT:", WC_ML_DSA_44, kat_mldsa44_pub,
        (word32)sizeof(kat_mldsa44_pub), kat_mldsa44_sig,
        (word32)sizeof(kat_mldsa44_sig), -1, NULL, 0);
    mo_verify("ML-DSA-65 verify KAT:", WC_ML_DSA_65, kat_mldsa65_pub,
        (word32)sizeof(kat_mldsa65_pub), kat_mldsa65_sig,
        (word32)sizeof(kat_mldsa65_sig), -1, NULL, 0);
    mo_verify("ML-DSA-87 verify KAT:", WC_ML_DSA_87, kat_mldsa87_pub,
        (word32)sizeof(kat_mldsa87_pub), kat_mldsa87_sig,
        (word32)sizeof(kat_mldsa87_sig), -1, NULL, 0);

    mo_verify("ML-DSA-44 VerifyCtxHash SHA-256 KAT:", WC_ML_DSA_44,
        kat_mldsa44_pub, (word32)sizeof(kat_mldsa44_pub),
        kat_mldsa44_sig_ph256, (word32)sizeof(kat_mldsa44_sig_ph256),
        WC_HASH_TYPE_SHA256, sha256, (word32)sizeof(sha256));
    mo_verify("ML-DSA-65 VerifyCtxHash SHA-256 KAT:", WC_ML_DSA_65,
        kat_mldsa65_pub, (word32)sizeof(kat_mldsa65_pub),
        kat_mldsa65_sig_ph256, (word32)sizeof(kat_mldsa65_sig_ph256),
        WC_HASH_TYPE_SHA256, sha256, (word32)sizeof(sha256));
    mo_verify("ML-DSA-87 VerifyCtxHash SHA-256 KAT:", WC_ML_DSA_87,
        kat_mldsa87_pub, (word32)sizeof(kat_mldsa87_pub),
        kat_mldsa87_sig_ph256, (word32)sizeof(kat_mldsa87_sig_ph256),
        WC_HASH_TYPE_SHA256, sha256, (word32)sizeof(sha256));
    mo_verify("ML-DSA-87 VerifyCtxHash SHA-512 KAT:", WC_ML_DSA_87,
        kat_mldsa87_pub, (word32)sizeof(kat_mldsa87_pub),
        kat_mldsa87_sig_ph512, (word32)sizeof(kat_mldsa87_sig_ph512),
        WC_HASH_TYPE_SHA512, sha512, (word32)sizeof(sha512));

    /* Negative case: every check above is positive, so a verify that returned
     * success unconditionally - or a w1 encoder that collapsed distinct
     * commitments - would pass them all.  Flip one octet of the level-44
     * signature and require a clean rejection. */
    {
        static byte bad[WC_MLDSA_44_SIG_SIZE];
        int bres = 1;
        int bret;

        XMEMCPY(bad, kat_mldsa44_sig, sizeof(bad));
        bad[sizeof(bad) / 2] ^= 0x01;

        bret = wc_MlDsaKey_Init(&mo_key, NULL, INVALID_DEVID);
        if (bret == 0) {
            bret = wc_MlDsaKey_SetParams(&mo_key, WC_ML_DSA_44);
        }
        if (bret == 0) {
            bret = wc_MlDsaKey_ImportPubRaw(&mo_key, kat_mldsa44_pub,
                (word32)sizeof(kat_mldsa44_pub));
        }
        if (bret == 0) {
            bret = wc_MlDsaKey_VerifyCtx(&mo_key, bad, (word32)sizeof(bad),
                NULL, 0, mo_msg, (word32)sizeof(mo_msg), &bres);
        }
        /* A corrupt signature must be rejected, not error out. */
        printf("ML-DSA-44 corrupted-signature reject: %s (ret=%d res=%d)\r\n",
               ((bret == 0) && (bres == 0)) ? "PASS" : "FAIL", bret, bres);
        wc_MlDsaKey_Free(&mo_key);
    }

    mo_packed_verify();
}
#endif /* WOLF_MLDSA_OCTETS */

#ifdef WOLF_SECUREBOOT
/* ------------------------------------------------------------------------- */
/* Pure-mode ML-DSA secure boot (make SECUREBOOT=1)                          */
/* ------------------------------------------------------------------------- */
/* Verifies a firmware image that is stored PACKED in flash - two octets per
 * 16-bit cell, the layout a host signing tool and the C28x programmer produce -
 * without ever holding the image in RAM.
 *
 * ML-DSA has no streaming interface, but the message reaches the algorithm only
 * through mu = SHAKE256(tr || 0x00 || ctxLen || ctx || M), and a hash streams.
 * wc_MlDsaKey_VerifyMu() takes mu directly (ExternalMu-ML-DSA), so the image is
 * read a chunk at a time, expanded with wc_UnpackOctets(), and absorbed.
 * RAM cost is the chunk buffer plus 128 octets, whatever the image size. */

#define SB_CHUNK 256            /* octets per flash read */

static wc_MlDsaKey sb_key;      /* .bss: too big for the 16 KW C28x stack */

/* Build mu over the packed image.  flip < 0 leaves the image intact; otherwise
 * one octet is corrupted, to prove a bad image is rejected. */
static int sb_build_mu(byte* mu, long flip)
{
    wc_Shake sh;
    byte tr[MLDSA_TR_SZ];
    byte buf[SB_CHUNK];
    byte prefix[2];
    word32 off;
    int ret;

    /* tr = SHAKE256(raw public key).  Constant for a fixed verification key,
     * so a production bootloader would precompute this at build time. */
    ret = wc_InitShake256(&sh, NULL, INVALID_DEVID);
    if (ret == 0) {
        ret = wc_Shake256_Update(&sh, sb_mldsa87_pub,
            (word32)sizeof(sb_mldsa87_pub));
    }
    if (ret == 0) {
        ret = wc_Shake256_Final(&sh, tr, (word32)sizeof(tr));
    }
    wc_Shake256_Free(&sh);
    if (ret != 0) {
        return ret;
    }

    /* mu = SHAKE256(tr || 0x00 || ctxLen || ctx || image).  0x00 selects pure
     * (non pre-hash) mode; the context here is empty. */
    prefix[0] = 0x00;
    prefix[1] = 0x00;
    ret = wc_InitShake256(&sh, NULL, INVALID_DEVID);
    if (ret == 0) {
        ret = wc_Shake256_Update(&sh, tr, (word32)sizeof(tr));
    }
    if (ret == 0) {
        ret = wc_Shake256_Update(&sh, prefix, 2);
    }
    for (off = 0; (ret == 0) && (off < SB_IMG_SZ); off += SB_CHUNK) {
        word32 n = SB_IMG_SZ - off;
        if (n > SB_CHUNK) {
            n = SB_CHUNK;
        }
        ret = wc_UnpackOctets(buf, (word32)sizeof(buf),
            (const byte*)sb_image_packed + (off / WC_OCTETS_PER_BYTE),
            WC_PACKED_CELLS(n), n);
        if ((ret == 0) && (flip >= 0) &&
            ((word32)flip >= off) && ((word32)flip < off + n)) {
            buf[(word32)flip - off] ^= 0x01;
        }
        if (ret == 0) {
            ret = wc_Shake256_Update(&sh, buf, n);
        }
    }
    if (ret == 0) {
        ret = wc_Shake256_Final(&sh, mu, MLDSA_MU_SZ);
    }
    wc_Shake256_Free(&sh);
    return ret;
}

static void sb_verify(const char* what, long flip, int want)
{
    byte mu[MLDSA_MU_SZ];
    int res = -1;
    int ret;

    ret = sb_build_mu(mu, flip);
    if (ret == 0) {
        ret = wc_MlDsaKey_Init(&sb_key, NULL, INVALID_DEVID);
    }
    if (ret == 0) {
        ret = wc_MlDsaKey_SetParams(&sb_key, WC_ML_DSA_87);
    }
    if (ret == 0) {
        ret = wc_MlDsaKey_ImportPubRaw(&sb_key, sb_mldsa87_pub,
            (word32)sizeof(sb_mldsa87_pub));
    }
#ifdef WOLFSSL_MLDSA_VERIFY_PRECOMP_A
    if (ret == 0) {
        /* A was expanded at build time and lives in flash: verify skips the
         * SHAKE128 rejection sampling entirely. */
        ret = wc_MlDsaKey_SetPrecompA(&sb_key, sb_mldsa87_A, SB_A_LEN,
            sb_rho, (word32)sizeof(sb_rho));
    }
#endif
    if (ret == 0) {
        ret = wc_MlDsaKey_VerifyMu(&sb_key, sb_mldsa87_sig,
            (word32)sizeof(sb_mldsa87_sig), mu, MLDSA_MU_SZ, &res);
    }
    printf("%s %s (ret=%d res=%d)\r\n", what,
           ((ret == 0) && (res == want)) ? "PASS" : "FAIL", ret, res);
    wc_MlDsaKey_Free(&sb_key);
}

static void wolf_secureboot_test(void)
{
    printf("secure boot: %lu-octet packed image, %u-octet chunks, "
           "image never resident\r\n",
           (unsigned long)SB_IMG_SZ, (unsigned)SB_CHUNK);
#ifdef WOLFSSL_MLDSA_VERIFY_PRECOMP_A
    printf("matrix A: precomputed in flash (%ld coefficients)\r\n",
           (long)SB_A_LEN);
#else
    printf("matrix A: expanded at run time (SHAKE128 rejection sampling)\r\n");
#endif
    sb_verify("ML-DSA-87 pure-mode packed-image verify:", -1, 1);
    sb_verify("ML-DSA-87 corrupted-image reject:", SB_IMG_SZ / 2, 0);

