yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
#ifdef WOLF_MLDSA_VERIFY_BENCH
    /* Time the ML-DSA verify alone (mu is already built), which is the figure
     * a bootloader budget cares about. */
    {
        byte mu[MLDSA_MU_SZ];
        int res = 0;
        int bret;
        int bi;
        double t;

        /* Time mu construction too: for a real firmware image the streamed
         * SHAKE-256 hashing, not the ML-DSA verify, sets the boot budget. */
        (void)current_time(1);
        bret = sb_build_mu(mu, -1);
        t = current_time(0);
        if (bret == 0) {
            printf("mu build (%lu octets streamed): %.2f ms = %.1f KiB/s\r\n",
                   (unsigned long)SB_IMG_SZ, t * 1000.0,
                   ((double)SB_IMG_SZ / 1024.0) / t);
        }
        if (bret == 0) {
            bret = wc_MlDsaKey_Init(&sb_key, NULL, INVALID_DEVID);
        }
        if (bret == 0) {
            bret = wc_MlDsaKey_SetParams(&sb_key, WC_ML_DSA_87);
        }
        if (bret == 0) {
            bret = wc_MlDsaKey_ImportPubRaw(&sb_key, sb_mldsa87_pub,
                (word32)sizeof(sb_mldsa87_pub));
        }
#ifdef WOLFSSL_MLDSA_VERIFY_PRECOMP_A
        if (bret == 0) {
            bret = wc_MlDsaKey_SetPrecompA(&sb_key, sb_mldsa87_A, SB_A_LEN,
                sb_rho, (word32)sizeof(sb_rho));
        }
#endif
        if (bret == 0) {
            (void)current_time(1);
            for (bi = 0; bi < 10; bi++) {
                (void)wc_MlDsaKey_VerifyMu(&sb_key, sb_mldsa87_sig,
                    (word32)sizeof(sb_mldsa87_sig), mu, MLDSA_MU_SZ, &res);
            }
            t = current_time(0);
            printf("ML-DSA-87 VerifyMu bench: 10 ops in %.3f s = %.2f ms/op\r\n",
                   t, (t * 1000.0) / 10.0);
        }
        wc_MlDsaKey_Free(&sb_key);
    }
#endif
}
#endif /* WOLF_SECUREBOOT */

#ifdef WOLF_MLDSA_SIGN
/* ML-DSA-87 sign+verify round-trip (keygen -> sign -> verify).  Exercises
 * the full signer on the C28x.  Uses the DEV RNG stub (NOT secure) - this
 * proves functional correctness, not security. */
static void wolf_mldsa87_sign_test(void)
{
    WC_RNG sg_rng;
    word32 sg_sigLen = (word32)sizeof(sg_sig);
    int sg_i, sg_res = 0, sg_ret;
#ifdef WOLF_MLDSA_SIGN_BENCH
    double t;
    int    b;
#endif

    for (sg_i = 0; sg_i < (int)sizeof(sg_msg); sg_i++) {
        sg_msg[sg_i] = (byte)(sg_i & 0xFF);
    }
    sg_ret = wc_InitRng(&sg_rng);
    if (sg_ret == 0) {
        sg_ret = wc_MlDsaKey_Init(&sgk, NULL, INVALID_DEVID);
    }
    if (sg_ret == 0) {
        sg_ret = wc_MlDsaKey_SetParams(&sgk, WC_ML_DSA_87);
    }
    if (sg_ret == 0) {
        MEMPROF_BEGIN();
        sg_ret = wc_MlDsaKey_MakeKey(&sgk, &sg_rng);
        MEMPROF_END("ML-DSA-87", "keygen");
    }
    printf("ML-DSA-87 MakeKey: ret=%d\r\n", sg_ret);
    if (sg_ret == 0) {
        MEMPROF_BEGIN();
        sg_ret = wc_MlDsaKey_SignCtx(&sgk, NULL, 0, sg_sig, &sg_sigLen,
            sg_msg, (word32)sizeof(sg_msg), &sg_rng);
        MEMPROF_END("ML-DSA-87", "sign");
    }
    printf("ML-DSA-87 Sign: ret=%d sigLen=%lu\r\n", sg_ret,
           (unsigned long)sg_sigLen);
#ifdef WOLF_MEM_PROFILE
    printf("MEMPROF ML-DSA-87 key_sizeof=%lu octets\r\n",
           (unsigned long)sizeof(sgk) * 2UL);
#endif
    if (sg_ret == 0) {
        sg_ret = wc_MlDsaKey_VerifyCtx(&sgk, sg_sig, sg_sigLen, NULL, 0,
            sg_msg, (word32)sizeof(sg_msg), &sg_res);
    }
    printf("ML-DSA-87 sign/verify round-trip: %s (ret=%d res=%d)\r\n",
           (sg_ret == 0 && sg_res == 1) ? "PASS" : "FAIL", sg_ret, sg_res);
#ifdef WOLF_MLDSA_SIGN_BENCH
    if (sg_ret == 0) {
        (void)current_time(1);
        for (b = 0; b < 3; b++) {
            (void)wc_MlDsaKey_MakeKey(&sgk, &sg_rng);
        }
        t = current_time(0);
        printf("ML-DSA-87 keygen bench: 3 ops in %.3f s = %.2f ms/op\r\n",
               t, t * 1000.0 / 3);
        (void)current_time(1);
        for (b = 0; b < 3; b++) {
            sg_sigLen = (word32)sizeof(sg_sig);
            (void)wc_MlDsaKey_SignCtx(&sgk, NULL, 0, sg_sig, &sg_sigLen,
                sg_msg, (word32)sizeof(sg_msg), &sg_rng);
        }
        t = current_time(0);
        printf("ML-DSA-87 sign bench: 3 ops in %.3f s = %.2f ms/op\r\n",
               t, t * 1000.0 / 3);
    }
#endif /* WOLF_MLDSA_SIGN_BENCH */
    wc_MlDsaKey_Free(&sgk);
    wc_FreeRng(&sg_rng);
}
#endif /* WOLF_MLDSA_SIGN */

#ifdef WOLF_MLKEM
static void wolf_mlkem768_test(void)
{
    /* Key struct and key/CT buffers are static (.bss), NOT stack: the C28x
     * stack pointer is 16-bit, so the whole stack is 16 KW (see the linker
     * command file), and MlKemKey plus the encoded public/private key buffers
     * alone would overflow it.  Same rule as README.md "Notes on the C28x". */
    static MlKemKey kemk;
    static byte kem_pk[WC_ML_KEM_768_PUBLIC_KEY_SIZE];
    static byte kem_sk[WC_ML_KEM_768_PRIVATE_KEY_SIZE];
    static byte kem_ct[WC_ML_KEM_768_CIPHER_TEXT_SIZE];
    static byte kem_ss1[WC_ML_KEM_SS_SZ];
    static byte kem_ss2[WC_ML_KEM_SS_SZ];
    static byte kem_seed[64];
    static byte kem_coins[32];
    word32 kem_pklen = (word32)sizeof(kem_pk);
    word32 kem_sklen = (word32)sizeof(kem_sk);
    int kem_ret, kem_ok = 0, i;

    /* Deterministic seed/coins identical to the host reference dumper, so
     * pk/ct/ss can be diffed byte-for-byte to localize a CHAR_BIT==16 bug. */
    for (i = 0; i < 64; i++) {
        kem_seed[i] = (byte)i;
    }
    for (i = 0; i < 32; i++) {
        kem_coins[i] = (byte)(0x40 + i);
    }
    kem_ret = wc_MlKemKey_Init(&kemk, WC_ML_KEM_768, NULL, INVALID_DEVID);
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_MakeKeyWithRandom(&kemk, kem_seed, 64);
    }
    printf("ML-KEM-768 MakeKey: ret=%d\r\n", kem_ret);
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_EncodePublicKey(&kemk, kem_pk, kem_pklen);
    }
    if (kem_ret == 0) {
        kem_dump("PK", kem_pk, (int)kem_pklen, 32, 16);
    }
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_EncodePrivateKey(&kemk, kem_sk, kem_sklen);
    }
    if (kem_ret == 0) {
        kem_dump("SK", kem_sk, (int)sizeof(kem_sk), 32, 16);
    }
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_EncapsulateWithRandom(&kemk, kem_ct, kem_ss1,
            kem_coins, 32);
    }
    printf("ML-KEM-768 Encapsulate: ret=%d\r\n", kem_ret);
    if (kem_ret == 0) {
        kem_dump("CT", kem_ct, (int)sizeof(kem_ct), 32, 16);
        kem_dump("SS", kem_ss1, (int)WC_ML_KEM_SS_SZ, 32, 0);
    }
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_Decapsulate(&kemk, kem_ss2, kem_ct,
            (word32)sizeof(kem_ct));
    }
    if (kem_ret == 0) {
        kem_ok = (XMEMCMP(kem_ss1, kem_ss2, WC_ML_KEM_SS_SZ) == 0);
    }
    printf("ML-KEM-768 encap/decap round-trip: %s (ret=%d ss_match=%d)\r\n",
           (kem_ret == 0 && kem_ok) ? "PASS" : "FAIL", kem_ret, kem_ok);
    wc_MlKemKey_Free(&kemk);
}
#endif /* WOLF_MLKEM */

#ifdef WOLF_ENTROPY
/* On-target validation of the entropy source.  Beyond the port's SP800-90B
 * health tests, this screens what a stuck or test-only source would fail: the
 * raw noise is neither constant nor grossly biased, and the DRBG seeds.  The
 * bit-count check is coarse - the real min-entropy assessment is the host
 * analysis of an ENTROPY_PROBE=1 capture (wolfSSL IDE/C2000/README.md). */
static void wolf_entropy_test(void)
{
    static byte raw[256];
    static byte s1[32], s2[32];
    WC_RNG rng;
    word32 ones;
    word32 i;
    int b;
    int ret;
    int src;

