yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    ret = wc_c2000_Entropy_Init();
    printf("Entropy init + startup health test: %s (ret=%d)\r\n",
           (ret == 0) ? "PASS" : "FAIL", ret);
    if (ret != 0) {
        return;
    }

    ret = wc_c2000_Entropy_SelfTest();
    printf("Entropy liveness self-test (raw): %s (ret=%d)\r\n",
           (ret == 0) ? "PASS" : "FAIL", ret);

    /* Raw noise sanity per source: population count should sit near half.
     * Source 1 is optional - a build that needs DCC0 elsewhere sets
     * WOLFSSL_C2000_ENTROPY_NUM_SRC to 1. */
    for (src = 0; src < WOLFSSL_C2000_ENTROPY_NUM_SRC; src++) {
        ret = wc_c2000_Entropy_GetRaw(raw, (word32)sizeof(raw), src);
        if (ret != 0) {
            /* raw[] holds stale data on failure, so counting it would report a
             * meaningless balance.  Report the read error instead. */
            printf("Entropy raw src%d bit balance: FAIL (read error %d)\r\n",
                   src, ret);
            continue;
        }
        ones = 0;
        for (i = 0; i < (word32)sizeof(raw); i++) {
            for (b = 0; b < 8; b++) {
                if ((raw[i] >> b) & 1) {
                    ones++;
                }
            }
        }
        /* 2048 bits; accept 40%..60% ones, i.e. counts 820..1228. */
        printf("Entropy raw src%d bit balance: %s (%lu/2048 ones)\r\n",
               src,
               (ones > 819UL && ones < 1229UL) ? "PASS" : "FAIL",
               (unsigned long)ones);
    }

    /* End to end: the DRBG must seed and produce differing blocks. */
    ret = wc_InitRng(&rng);
    printf("wc_InitRng with real entropy: %s (ret=%d)\r\n",
           (ret == 0) ? "PASS" : "FAIL", ret);
    if (ret == 0) {
        ret = wc_RNG_GenerateBlock(&rng, s1, (word32)sizeof(s1));
        if (ret == 0) {
            ret = wc_RNG_GenerateBlock(&rng, s2, (word32)sizeof(s2));
        }
        printf("RNG blocks differ: %s\r\n",
               (ret == 0 && XMEMCMP(s1, s2, sizeof(s1)) != 0)
                   ? "PASS" : "FAIL");
        wc_FreeRng(&rng);
    }
}
#endif /* WOLF_ENTROPY */

#ifdef WOLF_AES
static void wolf_aes_test(void)
{
    /* AES-128 NIST SP800-38A vectors (CBC/CTR/CFB) + McGrew GCM case 2. */
    static const byte k[16] = {
        0x2b,0x7e,0x15,0x16,0x28,0xae,0xd2,0xa6,
        0xab,0xf7,0x15,0x88,0x09,0xcf,0x4f,0x3c};
    static const byte iv[16] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
        0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f};
    static const byte pt[16] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a};
    static const byte cbc_ct[16] = {
        0x76,0x49,0xab,0xac,0x81,0x19,0xb2,0x46,
        0xce,0xe9,0x8e,0x9b,0x12,0xe9,0x19,0x7d};
    static const byte ctr_iv[16] = {
        0xf0,0xf1,0xf2,0xf3,0xf4,0xf5,0xf6,0xf7,
        0xf8,0xf9,0xfa,0xfb,0xfc,0xfd,0xfe,0xff};
    static const byte ctr_ct[16] = {
        0x87,0x4d,0x61,0x91,0xb6,0x20,0xe3,0x26,
        0x1b,0xef,0x68,0x64,0x99,0x0d,0xb6,0xce};
    static const byte cfb_ct[16] = {
        0x3b,0x3f,0xd9,0x2e,0xb7,0x2d,0xad,0x20,
        0x33,0x34,0x49,0xf8,0xe8,0x3c,0xfb,0x4a};
    static const byte gk[16] = {0};
    static const byte giv[12] = {0};
    static const byte gpt[16] = {0};
    static const byte gct[16] = {
        0x03,0x88,0xda,0xce,0x60,0xb6,0xa3,0x92,
        0xf3,0x28,0xc2,0xb9,0x71,0xb2,0xfe,0x78};
    static const byte gtag[16] = {
        0xab,0x6e,0x47,0xd4,0x2c,0xec,0x13,0xbd,
        0xf5,0x3a,0x67,0xb2,0x12,0x57,0xbd,0xdf};
    static Aes aes;
    static byte o[16], o2[16], tag[16];
    int r;

    /* Must be initialised, and explicitly with INVALID_DEVID: a static Aes
     * zero-fills devId to 0, which is a valid device id, so with WOLF_CRYPTO_CB
     * built in (HWAES=1) every aes.c hook would attempt callback dispatch
     * instead of skipping.  This is the software reference for the HW-vs-SW
     * cross-checks, so it must stay unambiguously software. */
    r = wc_AesInit(&aes, NULL, INVALID_DEVID);
    if (r != 0) {
        printf("AES software test: FAIL (init ret=%d)\r\n", r);
        return;
    }

    /* CBC */
    r = wc_AesSetKey(&aes, k, 16, iv, AES_ENCRYPTION);
    if (r == 0) r = wc_AesCbcEncrypt(&aes, o, pt, 16);
    printf("AES-128-CBC encrypt: %s\r\n",
        (r == 0 && XMEMCMP(o, cbc_ct, 16) == 0) ? "PASS" : "FAIL");
    r = wc_AesSetKey(&aes, k, 16, iv, AES_DECRYPTION);
    if (r == 0) r = wc_AesCbcDecrypt(&aes, o2, cbc_ct, 16);
    printf("AES-128-CBC decrypt: %s\r\n",
        (r == 0 && XMEMCMP(o2, pt, 16) == 0) ? "PASS" : "FAIL");

    /* CTR (encrypt == decrypt) */
    r = wc_AesSetKey(&aes, k, 16, ctr_iv, AES_ENCRYPTION);
    if (r == 0) r = wc_AesCtrEncrypt(&aes, o, pt, 16);
    printf("AES-128-CTR: %s\r\n",
        (r == 0 && XMEMCMP(o, ctr_ct, 16) == 0) ? "PASS" : "FAIL");

    /* CFB128 */
    r = wc_AesSetKey(&aes, k, 16, iv, AES_ENCRYPTION);
    if (r == 0) r = wc_AesCfbEncrypt(&aes, o, pt, 16);
    printf("AES-128-CFB encrypt: %s\r\n",
        (r == 0 && XMEMCMP(o, cfb_ct, 16) == 0) ? "PASS" : "FAIL");
    r = wc_AesSetKey(&aes, k, 16, iv, AES_ENCRYPTION);
    if (r == 0) r = wc_AesCfbDecrypt(&aes, o2, cfb_ct, 16);
    printf("AES-128-CFB decrypt: %s\r\n",
        (r == 0 && XMEMCMP(o2, pt, 16) == 0) ? "PASS" : "FAIL");

    /* GCM */
    r = wc_AesGcmSetKey(&aes, gk, 16);
    if (r == 0) r = wc_AesGcmEncrypt(&aes, o, gpt, 16, giv, 12,
        tag, 16, NULL, 0);
    printf("AES-128-GCM encrypt: %s (ct=%d tag=%d)\r\n",
        (r == 0 && XMEMCMP(o, gct, 16) == 0 &&
         XMEMCMP(tag, gtag, 16) == 0) ? "PASS" : "FAIL",
        (r == 0) ? (XMEMCMP(o, gct, 16) == 0) : -1,
        (r == 0) ? (XMEMCMP(tag, gtag, 16) == 0) : -1);
    r = wc_AesGcmDecrypt(&aes, o2, gct, 16, giv, 12, gtag, 16, NULL, 0);
    printf("AES-128-GCM decrypt+verify: %s\r\n",
        (r == 0 && XMEMCMP(o2, gpt, 16) == 0) ? "PASS" : "FAIL");
    wc_AesFree(&aes);
}
#endif /* WOLF_AES */

#ifdef WOLF_HWAES
/* Cross-check the AESA hardware against software AES.
 *
 * Two contexts deliberately: 'hw' carries WOLFSSL_C2000_DEVID so every aes.c
 * hook routes to the callback, 'sw' carries INVALID_DEVID so every hook skips
 * it.  That separation matters -- with HAVE_AES_ECB on, a devId-bearing
 * context would route even the software CTR path's internal wc_AesEcbEncrypt
 * back to hardware.
 *
 * NIST SP800-38A vectors are asserted where we have them; multi-block,
 * split-call and in-place cases are checked hardware-against-software, since
 * software AES is already covered by wolfcrypt_test. */
/* Set only when the AESA device actually registered.  Without it the 'hw'
 * context silently falls back to software and every cross-check would compare
 * software against software and report PASS. */
static int g_aesaReady = 0;

static void hw_report(const char* name, int r, const byte* a, const byte* b,
                      word32 len)
{
    int cmp = XMEMCMP(a, b, len);
    printf("HW %s: %s (ret=%d cmp=%d)\r\n", name,
        (r == 0 && cmp == 0) ? "PASS" : "FAIL", r, cmp);
}

static void wolf_aes_hw_test(void)
{
    /* NIST SP800-38A F.1/F.2/F.5 four-block plaintext. */
    static const byte pt[64] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a,
        0xae,0x2d,0x8a,0x57,0x1e,0x03,0xac,0x9c,
        0x9e,0xb7,0x6f,0xac,0x45,0xaf,0x8e,0x51,
        0x30,0xc8,0x1c,0x46,0xa3,0x5c,0xe4,0x11,
        0xe5,0xfb,0xc1,0x19,0x1a,0x0a,0x52,0xef,
        0xf6,0x9f,0x24,0x45,0xdf,0x4f,0x9b,0x17,
        0xad,0x2b,0x41,0x7b,0xe6,0x6c,0x37,0x10};
    static const byte k128[16] = {
        0x2b,0x7e,0x15,0x16,0x28,0xae,0xd2,0xa6,
        0xab,0xf7,0x15,0x88,0x09,0xcf,0x4f,0x3c};
    static const byte k192[24] = {
        0x8e,0x73,0xb0,0xf7,0xda,0x0e,0x64,0x52,
        0xc8,0x10,0xf3,0x2b,0x80,0x90,0x79,0xe5,
        0x62,0xf8,0xea,0xd2,0x52,0x2c,0x6b,0x7b};
    static const byte k256[32] = {
        0x60,0x3d,0xeb,0x10,0x15,0xca,0x71,0xbe,
        0x2b,0x73,0xae,0xf0,0x85,0x7d,0x77,0x81,
        0x1f,0x35,0x2c,0x07,0x3b,0x61,0x08,0xd7,
        0x2d,0x98,0x10,0xa3,0x09,0x14,0xdf,0xf4};
    static const byte iv[16] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
        0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f};
    static const byte ctr_iv[16] = {
        0xf0,0xf1,0xf2,0xf3,0xf4,0xf5,0xf6,0xf7,
        0xf8,0xf9,0xfa,0xfb,0xfc,0xfd,0xfe,0xff};
    /* First-block published answers (F.1.1, F.2.1, F.5.1). */
    static const byte ecb_ct1[16] = {
        0x3a,0xd7,0x7b,0xb4,0x0d,0x7a,0x36,0x60,
        0xa8,0x9e,0xca,0xf3,0x24,0x66,0xef,0x97};
    static const byte cbc_ct1[16] = {
        0x76,0x49,0xab,0xac,0x81,0x19,0xb2,0x46,
        0xce,0xe9,0x8e,0x9b,0x12,0xe9,0x19,0x7d};
    /* Full 64-octet CTR answer, not just block 1: this vector's counter starts
     * at ...fe ff, so block 2 is the first needing a carry across an octet
     * boundary, and checking only block 1 hides a broken increment. */
    static const byte ctr_ct[64] = {
        0x87,0x4d,0x61,0x91,0xb6,0x20,0xe3,0x26,
        0x1b,0xef,0x68,0x64,0x99,0x0d,0xb6,0xce,
        0x98,0x06,0xf6,0x6b,0x79,0x70,0xfd,0xff,
        0x86,0x17,0x18,0x7b,0xb9,0xff,0xfd,0xff,
        0x5a,0xe4,0xdf,0x3e,0xdb,0xd5,0xd3,0x5e,
        0x5b,0x4f,0x09,0x02,0x0d,0xb0,0x3e,0xab,
        0x1e,0x03,0x1d,0xda,0x2f,0xbe,0x03,0xd1,
        0x79,0x21,0x70,0xa0,0xf3,0x00,0x9c,0xee};

    /* .bss, not stack: the C28x stack is 16 KW and an Aes is not small. */
    static Aes hw, sw;
    static byte oh[64], os[64], dh[64];
    int rh, rs;

    if (!g_aesaReady) {
        printf("HW AES cross-checks: SKIP (AESA not registered)\r\n");
        return;
    }

