yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    rh = wc_AesInit(&hw, NULL, WOLFSSL_C2000_DEVID);
    if (rh != 0) {
        printf("HW AES init (hw ctx): FAIL (ret=%d)\r\n", rh);
        return;
    }
    rs = wc_AesInit(&sw, NULL, INVALID_DEVID);
    if (rs != 0) {
        printf("HW AES init (sw ctx): FAIL (ret=%d)\r\n", rs);
        wc_AesFree(&hw);
        return;
    }

    /* ---- ECB, 64 octets (exercises the multi-block loop) ---- */
    rh = wc_AesSetKey(&hw, k128, 16, NULL, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k128, 16, NULL, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesEcbEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesEcbEncrypt(&sw, os, pt, 64);
    hw_report("AES-128-ECB encrypt vs NIST", rh, oh, ecb_ct1, 16);
    hw_report("AES-128-ECB encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    rh = wc_AesSetKey(&hw, k128, 16, NULL, AES_DECRYPTION);
    if (rh == 0) rh = wc_AesEcbDecrypt(&hw, dh, oh, 64);
    hw_report("AES-128-ECB decrypt round-trip", rh, dh, pt, 64);

    /* ---- CBC, 64 octets ---- */
    rh = wc_AesSetKey(&hw, k128, 16, iv, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k128, 16, iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCbcEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesCbcEncrypt(&sw, os, pt, 64);
    hw_report("AES-128-CBC encrypt vs NIST", rh, oh, cbc_ct1, 16);
    hw_report("AES-128-CBC encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    rh = wc_AesSetKey(&hw, k128, 16, iv, AES_DECRYPTION);
    if (rh == 0) rh = wc_AesCbcDecrypt(&hw, dh, oh, 64);
    hw_report("AES-128-CBC decrypt round-trip", rh, dh, pt, 64);

    /* ---- CBC split across calls: proves aes->reg chaining ---- */
    rh = wc_AesSetKey(&hw, k128, 16, iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCbcEncrypt(&hw, oh, pt, 16);
    if (rh == 0) rh = wc_AesCbcEncrypt(&hw, oh + 16, pt + 16, 48);
    hw_report("AES-128-CBC split-call chain", rh, oh, os, 64);

    /* ---- CBC in-place decrypt: proves the last-block save ---- */
    XMEMCPY(dh, os, 64);
    rh = wc_AesSetKey(&hw, k128, 16, iv, AES_DECRYPTION);
    if (rh == 0) rh = wc_AesCbcDecrypt(&hw, dh, dh, 64);
    hw_report("AES-128-CBC in-place decrypt", rh, dh, pt, 64);

    /* ---- CTR, 64 octets ---- */
    rh = wc_AesSetKey(&hw, k128, 16, ctr_iv, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k128, 16, ctr_iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCtrEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesCtrEncrypt(&sw, os, pt, 64);
    hw_report("AES-128-CTR vs NIST (64B)", rh, oh, ctr_ct, 64);
    hw_report("AES-128-CTR SW vs NIST (64B)", rs, os, ctr_ct, 64);
    hw_report("AES-128-CTR vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    /* ---- CTR split at a non-block boundary: proves aes->left/aes->tmp ---- */
    rh = wc_AesSetKey(&hw, k128, 16, ctr_iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCtrEncrypt(&hw, oh, pt, 10);
    if (rh == 0) rh = wc_AesCtrEncrypt(&hw, oh + 10, pt + 10, 54);
    hw_report("AES-128-CTR partial split", rh, oh, os, 64);

    /* ---- 192- and 256-bit keys: the 6- and 8-word AES_setKey1 paths ---- */
    rh = wc_AesSetKey(&hw, k192, 24, iv, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k192, 24, iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCbcEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesCbcEncrypt(&sw, os, pt, 64);
    hw_report("AES-192-CBC encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    rh = wc_AesSetKey(&hw, k256, 32, iv, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k256, 32, iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCbcEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesCbcEncrypt(&sw, os, pt, 64);
    hw_report("AES-256-CBC encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    /* ECB and CTR at 192/256 too: the accelerator's key schedule differs per
     * key size, and marshalling the longer schedule into its 32-bit registers
     * is exactly the octet handling this port is validating. */
    rh = wc_AesSetKey(&hw, k192, 24, NULL, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k192, 24, NULL, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesEcbEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesEcbEncrypt(&sw, os, pt, 64);
    hw_report("AES-192-ECB encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    rh = wc_AesSetKey(&hw, k256, 32, NULL, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k256, 32, NULL, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesEcbEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesEcbEncrypt(&sw, os, pt, 64);
    hw_report("AES-256-ECB encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    rh = wc_AesSetKey(&hw, k192, 24, ctr_iv, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k192, 24, ctr_iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCtrEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesCtrEncrypt(&sw, os, pt, 64);
    hw_report("AES-192-CTR encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    rh = wc_AesSetKey(&hw, k256, 32, ctr_iv, AES_ENCRYPTION);
    rs = wc_AesSetKey(&sw, k256, 32, ctr_iv, AES_ENCRYPTION);
    if (rh == 0) rh = wc_AesCtrEncrypt(&hw, oh, pt, 64);
    if (rs == 0) rs = wc_AesCtrEncrypt(&sw, os, pt, 64);
    hw_report("AES-256-CTR encrypt vs SW", ((rh != 0) ? rh : rs), oh, os, 64);

    wc_AesFree(&hw);
    wc_AesFree(&sw);
}
#endif /* WOLF_HWAES */

#ifdef WOLF_25519
static void wolf_curve25519_test(void)
{
    /* X25519 RFC 7748 6.1 Diffie-Hellman test vectors (little-endian). */
    static const byte a_priv[32] = {
        0x77,0x07,0x6d,0x0a,0x73,0x18,0xa5,0x7d,0x3c,0x16,0xc1,0x72,0x51,0xb2,0x66,0x45,
        0xdf,0x4c,0x2f,0x87,0xeb,0xc0,0x99,0x2a,0xb1,0x77,0xfb,0xa5,0x1d,0xb9,0x2c,0x2a};
    static const byte a_pub[32] = {
        0x85,0x20,0xf0,0x09,0x89,0x30,0xa7,0x54,0x74,0x8b,0x7d,0xdc,0xb4,0x3e,0xf7,0x5a,
        0x0d,0xbf,0x3a,0x0d,0x26,0x38,0x1a,0xf4,0xeb,0xa4,0xa9,0x8e,0xaa,0x9b,0x4e,0x6a};
    static const byte b_priv[32] = {
        0x5d,0xab,0x08,0x7e,0x62,0x4a,0x8a,0x4b,0x79,0xe1,0x7f,0x8b,0x83,0x80,0x0e,0xe6,
        0x6f,0x3b,0xb1,0x29,0x26,0x18,0xb6,0xfd,0x1c,0x2f,0x8b,0x27,0xff,0x88,0xe0,0xeb};
    static const byte b_pub[32] = {
        0xde,0x9e,0xdb,0x7d,0x7b,0x7d,0xc1,0xb4,0xd3,0x5b,0x61,0xc2,0xec,0xe4,0x35,0x37,
        0x3f,0x83,0x43,0xc8,0x5b,0x78,0x67,0x4d,0xad,0xfc,0x7e,0x14,0x6f,0x88,0x2b,0x4f};
    static const byte x_K[32] = {
        0x4a,0x5d,0x9d,0x5b,0xa4,0xce,0x2d,0xe1,0x72,0x8e,0x3b,0xf4,0x80,0x35,0x0f,0x25,
        0xe0,0x7e,0x21,0xc9,0x47,0xd1,0x9e,0x33,0x76,0xf0,0x9b,0x3c,0x1e,0x16,0x17,0x42};
    /* Ed25519 RFC 8032 Test 1 (empty message). */
    static const byte ed_sk[32] = {
        0x9d,0x61,0xb1,0x9d,0xef,0xfd,0x5a,0x60,0xba,0x84,0x4a,0xf4,0x92,0xec,0x2c,0xc4,
        0x44,0x49,0xc5,0x69,0x7b,0x32,0x69,0x19,0x70,0x3b,0xac,0x03,0x1c,0xae,0x7f,0x60};
    static const byte ed_pk[32] = {
        0xd7,0x5a,0x98,0x01,0x82,0xb1,0x0a,0xb7,0xd5,0x4b,0xfe,0xd3,0xc9,0x64,0x07,0x3a,
        0x0e,0xe1,0x72,0xf3,0xda,0xa6,0x23,0x25,0xaf,0x02,0x1a,0x68,0xf7,0x07,0x51,0x1a};
    static const byte ed_sig[64] = {
        0xe5,0x56,0x43,0x00,0xc3,0x60,0xac,0x72,0x90,0x86,0xe2,0xcc,0x80,0x6e,0x82,0x8a,
        0x84,0x87,0x7f,0x1e,0xb8,0xe5,0xd9,0x74,0xd8,0x73,0xe0,0x65,0x22,0x49,0x01,0x55,
        0x5f,0xb8,0x82,0x15,0x90,0xa3,0x3b,0xac,0xc6,0x1e,0x39,0x70,0x1c,0xf9,0xb4,0x6b,
        0xd2,0x5b,0xf5,0xf0,0x59,0x5b,0xbe,0x24,0x65,0x51,0x41,0x43,0x8e,0x7a,0x10,0x0b};
    static curve25519_key ca, cpa, cb, cpb;
    static ed25519_key ed;
    static WC_RNG rng;
    byte sh[32], sig[64], ap[32], bp[32];
    word32 shLen = sizeof(sh), sigLen = sizeof(sig);
    int r, vres = 0, ci, rngOk;

    /* X25519: shared = X25519(a_priv, b_pub) == X25519(b_priv, a_pub) == K.
     * wolfSSL requires the scalar to be pre-clamped (RFC 7748 sec 5); the
     * raw RFC 6.1 keys are not, so clamp a local copy (X25519 clamps the
     * same bits internally, so the shared secret still equals K).  The
     * default C build enables WOLFSSL_CURVE25519_BLINDING, so each private
     * key needs an RNG set (the result is unaffected). */
    rngOk = (wc_InitRng(&rng) == 0);
    if (!rngOk)
        printf("X25519: RNG init FAIL\r\n");
    for (ci = 0; ci < 32; ci++) { ap[ci] = a_priv[ci]; bp[ci] = b_priv[ci]; }
    ap[0] &= 248; ap[31] &= 127; ap[31] |= 64;
    bp[0] &= 248; bp[31] &= 127; bp[31] |= 64;
    wc_curve25519_init(&ca);  wc_curve25519_init(&cpb);
    r = wc_curve25519_import_private_ex(ap, 32, &ca, EC25519_LITTLE_ENDIAN);
    if (r == 0 && rngOk) r = wc_curve25519_set_rng(&ca, &rng);
    if (r == 0) r = wc_curve25519_import_public_ex(b_pub, 32, &cpb,
                                            EC25519_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve25519_shared_secret_ex(&ca, &cpb, sh, &shLen,
                                            EC25519_LITTLE_ENDIAN);
    printf("X25519 a*Bpub: %s\r\n",
        (r == 0 && shLen == 32 && XMEMCMP(sh, x_K, 32) == 0) ? "PASS":"FAIL");

