yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    wc_curve25519_init(&cb);  wc_curve25519_init(&cpa);
    shLen = sizeof(sh);
    r = wc_curve25519_import_private_ex(bp, 32, &cb, EC25519_LITTLE_ENDIAN);
    if (r == 0 && rngOk) r = wc_curve25519_set_rng(&cb, &rng);
    if (r == 0) r = wc_curve25519_import_public_ex(a_pub, 32, &cpa,
                                            EC25519_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve25519_shared_secret_ex(&cb, &cpa, sh, &shLen,
                                            EC25519_LITTLE_ENDIAN);
    printf("X25519 b*Apub: %s\r\n",
        (r == 0 && shLen == 32 && XMEMCMP(sh, x_K, 32) == 0) ? "PASS":"FAIL");
    wc_curve25519_free(&ca); wc_curve25519_free(&cpb);
    wc_curve25519_free(&cb); wc_curve25519_free(&cpa);
    if (rngOk) wc_FreeRng(&rng);

    /* Ed25519 RFC 8032 Test 1 (empty message): import (re-derives and
     * validates the public key on import), sign, compare to the RFC sig,
     * then verify.  inLen 0 still needs a non-NULL message pointer. */
    wc_ed25519_init(&ed);
    r = wc_ed25519_import_private_key(ed_sk, 32, ed_pk, 32, &ed);
    if (r == 0) r = wc_ed25519_sign_msg(ap, 0, sig, &sigLen, &ed);
    printf("Ed25519 sign:   %s\r\n",
        (r == 0 && sigLen == 64 && XMEMCMP(sig, ed_sig, 64) == 0) ?
        "PASS":"FAIL");
    r = wc_ed25519_verify_msg(ed_sig, 64, ap, 0, &vres, &ed);
    printf("Ed25519 verify: %s\r\n",
        (r == 0 && vres == 1) ? "PASS":"FAIL");
    wc_ed25519_free(&ed);
}
#endif /* WOLF_25519 */

#ifdef WOLF_448
static void wolf_curve448_test(void)
{
    /* X448 RFC 7748 6.2 Diffie-Hellman test vectors (little-endian). */
    static const byte x_a_priv[56] = {
        0x9a,0x8f,0x49,0x25,0xd1,0x51,0x9f,0x57,0x75,0xcf,0x46,0xb0,0x4b,0x58,0x00,0xd4,
        0xee,0x9e,0xe8,0xba,0xe8,0xbc,0x55,0x65,0xd4,0x98,0xc2,0x8d,0xd9,0xc9,0xba,0xf5,
        0x74,0xa9,0x41,0x97,0x44,0x89,0x73,0x91,0x00,0x63,0x82,0xa6,0xf1,0x27,0xab,0x1d,
        0x9a,0xc2,0xd8,0xc0,0xa5,0x98,0x72,0x6b
    };
    static const byte x_a_pub[56] = {
        0x9b,0x08,0xf7,0xcc,0x31,0xb7,0xe3,0xe6,0x7d,0x22,0xd5,0xae,0xa1,0x21,0x07,0x4a,
        0x27,0x3b,0xd2,0xb8,0x3d,0xe0,0x9c,0x63,0xfa,0xa7,0x3d,0x2c,0x22,0xc5,0xd9,0xbb,
        0xc8,0x36,0x64,0x72,0x41,0xd9,0x53,0xd4,0x0c,0x5b,0x12,0xda,0x88,0x12,0x0d,0x53,
        0x17,0x7f,0x80,0xe5,0x32,0xc4,0x1f,0xa0
    };
    static const byte x_b_priv[56] = {
        0x1c,0x30,0x6a,0x7a,0xc2,0xa0,0xe2,0xe0,0x99,0x0b,0x29,0x44,0x70,0xcb,0xa3,0x39,
        0xe6,0x45,0x37,0x72,0xb0,0x75,0x81,0x1d,0x8f,0xad,0x0d,0x1d,0x69,0x27,0xc1,0x20,
        0xbb,0x5e,0xe8,0x97,0x2b,0x0d,0x3e,0x21,0x37,0x4c,0x9c,0x92,0x1b,0x09,0xd1,0xb0,
        0x36,0x6f,0x10,0xb6,0x51,0x73,0x99,0x2d
    };
    static const byte x_b_pub[56] = {
        0x3e,0xb7,0xa8,0x29,0xb0,0xcd,0x20,0xf5,0xbc,0xfc,0x0b,0x59,0x9b,0x6f,0xec,0xcf,
        0x6d,0xa4,0x62,0x71,0x07,0xbd,0xb0,0xd4,0xf3,0x45,0xb4,0x30,0x27,0xd8,0xb9,0x72,
        0xfc,0x3e,0x34,0xfb,0x42,0x32,0xa1,0x3c,0xa7,0x06,0xdc,0xb5,0x7a,0xec,0x3d,0xae,
        0x07,0xbd,0xc1,0xc6,0x7b,0xf3,0x36,0x09
    };
    static const byte x_K[56] = {
        0x07,0xff,0xf4,0x18,0x1a,0xc6,0xcc,0x95,0xec,0x1c,0x16,0xa9,0x4a,0x0f,0x74,0xd1,
        0x2d,0xa2,0x32,0xce,0x40,0xa7,0x75,0x52,0x28,0x1d,0x28,0x2b,0xb6,0x0c,0x0b,0x56,
        0xfd,0x24,0x64,0xc3,0x35,0x54,0x39,0x36,0x52,0x1c,0x24,0x40,0x30,0x85,0xd5,0x9a,
        0x44,0x9a,0x50,0x37,0x51,0x4a,0x87,0x9d
    };
    /* Ed448 RFC 8032 7.4 first test ("Blank": empty message, empty
     * context).  The 57-byte secret/public keys and 114-byte signature. */
    static const byte ed_sk[57] = {
        0x6c,0x82,0xa5,0x62,0xcb,0x80,0x8d,0x10,0xd6,0x32,0xbe,0x89,0xc8,0x51,0x3e,0xbf,
        0x6c,0x92,0x9f,0x34,0xdd,0xfa,0x8c,0x9f,0x63,0xc9,0x96,0x0e,0xf6,0xe3,0x48,0xa3,
        0x52,0x8c,0x8a,0x3f,0xcc,0x2f,0x04,0x4e,0x39,0xa3,0xfc,0x5b,0x94,0x49,0x2f,0x8f,
        0x03,0x2e,0x75,0x49,0xa2,0x00,0x98,0xf9,0x5b
    };
    static const byte ed_pk[57] = {
        0x5f,0xd7,0x44,0x9b,0x59,0xb4,0x61,0xfd,0x2c,0xe7,0x87,0xec,0x61,0x6a,0xd4,0x6a,
        0x1d,0xa1,0x34,0x24,0x85,0xa7,0x0e,0x1f,0x8a,0x0e,0xa7,0x5d,0x80,0xe9,0x67,0x78,
        0xed,0xf1,0x24,0x76,0x9b,0x46,0xc7,0x06,0x1b,0xd6,0x78,0x3d,0xf1,0xe5,0x0f,0x6c,
        0xd1,0xfa,0x1a,0xbe,0xaf,0xe8,0x25,0x61,0x80
    };
    static const byte ed_sig[114] = {
        0x53,0x3a,0x37,0xf6,0xbb,0xe4,0x57,0x25,0x1f,0x02,0x3c,0x0d,0x88,0xf9,0x76,0xae,
        0x2d,0xfb,0x50,0x4a,0x84,0x3e,0x34,0xd2,0x07,0x4f,0xd8,0x23,0xd4,0x1a,0x59,0x1f,
        0x2b,0x23,0x3f,0x03,0x4f,0x62,0x82,0x81,0xf2,0xfd,0x7a,0x22,0xdd,0xd4,0x7d,0x78,
        0x28,0xc5,0x9b,0xd0,0xa2,0x1b,0xfd,0x39,0x80,0xff,0x0d,0x20,0x28,0xd4,0xb1,0x8a,
        0x9d,0xf6,0x3e,0x00,0x6c,0x5d,0x1c,0x2d,0x34,0x5b,0x92,0x5d,0x8d,0xc0,0x0b,0x41,
        0x04,0x85,0x2d,0xb9,0x9a,0xc5,0xc7,0xcd,0xda,0x85,0x30,0xa1,0x13,0xa0,0xf4,0xdb,
        0xb6,0x11,0x49,0xf0,0x5a,0x73,0x63,0x26,0x8c,0x71,0xd9,0x58,0x08,0xff,0x2e,0x65,
        0x26,0x00
    };
    static curve448_key xa, xpa, xb, xpb;
    static ed448_key ed;
    byte sh[56], sig[114];
    word32 shLen = sizeof(sh), sigLen = sizeof(sig);
    int r, vres = 0;

    /* X448: shared = X448(a_priv, b_pub) == X448(b_priv, a_pub) == K.
     * wc_curve448 clamps the scalar internally, so the raw RFC scalars
     * import directly; no caller-side clamp or RNG/blinding is needed. */
    wc_curve448_init(&xa);  wc_curve448_init(&xpb);
    r = wc_curve448_import_private_ex(x_a_priv, 56, &xa, EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_import_public_ex(x_b_pub, 56, &xpb,
                                            EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_shared_secret_ex(&xa, &xpb, sh, &shLen,
                                            EC448_LITTLE_ENDIAN);
    printf("X448 a*Bpub: %s\r\n",
        (r == 0 && shLen == 56 && XMEMCMP(sh, x_K, 56) == 0) ? "PASS":"FAIL");

    wc_curve448_init(&xb);  wc_curve448_init(&xpa);
    shLen = sizeof(sh);
    r = wc_curve448_import_private_ex(x_b_priv, 56, &xb, EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_import_public_ex(x_a_pub, 56, &xpa,
                                            EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_shared_secret_ex(&xb, &xpa, sh, &shLen,
                                            EC448_LITTLE_ENDIAN);
    printf("X448 b*Apub: %s\r\n",
        (r == 0 && shLen == 56 && XMEMCMP(sh, x_K, 56) == 0) ? "PASS":"FAIL");
    wc_curve448_free(&xa); wc_curve448_free(&xpb);
    wc_curve448_free(&xb); wc_curve448_free(&xpa);

    /* Ed448 RFC 8032 7.4 (blank): import, sign empty message with empty
     * context, compare to the RFC signature, then verify. */
    wc_ed448_init(&ed);
    r = wc_ed448_import_private_key(ed_sk, 57, ed_pk, 57, &ed);
    if (r == 0) r = wc_ed448_sign_msg(ed_sk, 0, sig, &sigLen, &ed, NULL, 0);
    printf("Ed448 sign:   %s\r\n",
        (r == 0 && sigLen == 114 && XMEMCMP(sig, ed_sig, 114) == 0) ?
        "PASS":"FAIL");
    r = wc_ed448_verify_msg(ed_sig, 114, ed_sk, 0, &vres, &ed, NULL, 0);
    printf("Ed448 verify: %s\r\n",
        (r == 0 && vres == 1) ? "PASS":"FAIL");
    wc_ed448_free(&ed);
}
#endif /* WOLF_448 */

#ifdef WOLF_HKDF
static void wolf_hkdf_test(void)
{
    /* HMAC-SHA256: RFC 4231 test case 2. */
    static const byte hk[4]  = {0x4a,0x65,0x66,0x65}; /* "Jefe" */
    static const byte hd[28] = {
        0x77,0x68,0x61,0x74,0x20,0x64,0x6f,0x20,0x79,0x61,0x20,0x77,0x61,0x6e,
        0x74,0x20,0x66,0x6f,0x72,0x20,0x6e,0x6f,0x74,0x68,0x69,0x6e,0x67,0x3f};
    static const byte hmac_exp[32] = {
        0x5b,0xdc,0xc1,0x46,0xbf,0x60,0x75,0x4e,0x6a,0x04,0x24,0x26,0x08,0x95,
        0x75,0xc7,0x5a,0x00,0x3f,0x08,0x9d,0x27,0x39,0x83,0x9d,0xec,0x58,0xb9,
        0x64,0xec,0x38,0x43};
    /* HKDF-SHA256: RFC 5869 test case 1. */
    static const byte ikm[22] = {
        0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,
        0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b};
    static const byte salt[13] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c};
    static const byte info[10] = {
        0xf0,0xf1,0xf2,0xf3,0xf4,0xf5,0xf6,0xf7,0xf8,0xf9};
    static const byte okm_exp[42] = {
        0x3c,0xb2,0x5f,0x25,0xfa,0xac,0xd5,0x7a,0x90,0x43,0x4f,0x64,0xd0,0x36,
        0x2f,0x2a,0x2d,0x2d,0x0a,0x90,0xcf,0x1a,0x5a,0x4c,0x5d,0xb0,0x2d,0x56,
        0xec,0xc4,0xc5,0xbf,0x34,0x00,0x72,0x08,0xd5,0xb8,0x87,0x18,0x58,0x65};
    Hmac hmac;
    byte mac[32], okm[42];
    int r;

    r = wc_HmacInit(&hmac, NULL, INVALID_DEVID);
    if (r == 0) r = wc_HmacSetKey(&hmac, WC_SHA256, hk, sizeof(hk));
    if (r == 0) r = wc_HmacUpdate(&hmac, hd, sizeof(hd));
    if (r == 0) r = wc_HmacFinal(&hmac, mac);
    printf("HMAC-SHA256:  %s\r\n",
        (r == 0 && XMEMCMP(mac, hmac_exp, 32) == 0) ? "PASS":"FAIL");
    wc_HmacFree(&hmac);

    r = wc_HKDF(WC_SHA256, ikm, sizeof(ikm), salt, sizeof(salt),
                info, sizeof(info), okm, sizeof(okm));
    printf("HKDF-SHA256:  %s\r\n",
        (r == 0 && XMEMCMP(okm, okm_exp, 42) == 0) ? "PASS":"FAIL");
}
#endif /* WOLF_HKDF */

#ifdef WOLF_CHACHA
static void wolf_poly1305_test(void)
{
    /* Standalone Poly1305 (RFC 8439 sec 2.5.2) to isolate MAC vs AEAD. */
    static const byte pk[32] = {
        0x85,0xd6,0xbe,0x78,0x57,0x55,0x6d,0x33,0x7f,0x44,0x52,0xfe,0x42,0xd5,0x06,0xa8,
        0x01,0x03,0x80,0x8a,0xfb,0x0d,0xb2,0xfd,0x4a,0xbf,0xf6,0xaf,0x41,0x49,0xf5,0x1b};
    static const byte pm[34] = {
        0x43,0x72,0x79,0x70,0x74,0x6f,0x67,0x72,0x61,0x70,0x68,0x69,0x63,0x20,0x46,0x6f,
        0x72,0x75,0x6d,0x20,0x52,0x65,0x73,0x65,0x61,0x72,0x63,0x68,0x20,0x47,0x72,0x6f,
        0x75,0x70};
    static const byte ptag_exp[16] = {
        0xa8,0x06,0x1d,0xc1,0x30,0x51,0x36,0xc6,0xc2,0x2b,0x8b,0xaf,0x0c,0x01,0x27,0xa9};
    Poly1305 poly;
    byte ptag[16];
    int pr;
    pr = wc_Poly1305SetKey(&poly, pk, sizeof(pk));
    if (pr == 0) pr = wc_Poly1305Update(&poly, pm, sizeof(pm));
    if (pr == 0) pr = wc_Poly1305Final(&poly, ptag);
    printf("Poly1305 (standalone): %s (t=%02x%02x%02x%02x exp=a8061dc1)\r\n",
        (pr == 0 && XMEMCMP(ptag, ptag_exp, 16) == 0) ? "PASS":"FAIL",
        ptag[0]&0xFF, ptag[1]&0xFF, ptag[2]&0xFF, ptag[3]&0xFF);
}
#endif /* WOLF_CHACHA */

#ifdef WOLF_CHACHA
static void wolf_chacha20_poly1305_test(void)
{
    static const byte key[32] = {
        0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,0x88,0x89,0x8a,0x8b,0x8c,0x8d,0x8e,0x8f,
        0x90,0x91,0x92,0x93,0x94,0x95,0x96,0x97,0x98,0x99,0x9a,0x9b,0x9c,0x9d,0x9e,0x9f};
    static const byte iv[12] = {
        0x07,0x00,0x00,0x00,0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47};
    static const byte aad[12] = {
        0x50,0x51,0x52,0x53,0xc0,0xc1,0xc2,0xc3,0xc4,0xc5,0xc6,0xc7};
    static const byte pt[114] = {
        0x4c,0x61,0x64,0x69,0x65,0x73,0x20,0x61,0x6e,0x64,0x20,0x47,0x65,0x6e,0x74,0x6c,
        0x65,0x6d,0x65,0x6e,0x20,0x6f,0x66,0x20,0x74,0x68,0x65,0x20,0x63,0x6c,0x61,0x73,
        0x73,0x20,0x6f,0x66,0x20,0x27,0x39,0x39,0x3a,0x20,0x49,0x66,0x20,0x49,0x20,0x63,
        0x6f,0x75,0x6c,0x64,0x20,0x6f,0x66,0x66,0x65,0x72,0x20,0x79,0x6f,0x75,0x20,0x6f,
        0x6e,0x6c,0x79,0x20,0x6f,0x6e,0x65,0x20,0x74,0x69,0x70,0x20,0x66,0x6f,0x72,0x20,
        0x74,0x68,0x65,0x20,0x66,0x75,0x74,0x75,0x72,0x65,0x2c,0x20,0x73,0x75,0x6e,0x73,
        0x63,0x72,0x65,0x65,0x6e,0x20,0x77,0x6f,0x75,0x6c,0x64,0x20,0x62,0x65,0x20,0x69,
        0x74,0x2e};
    static const byte ct0[4]  = {0xd3,0x1a,0x8d,0x34}; /* RFC ciphertext head */
    static const byte tag_exp[16] = {
        0x1a,0xe1,0x0b,0x59,0x4f,0x09,0xe2,0x6a,0x7e,0x90,0x2e,0xcb,0xd0,0x60,0x06,0x91};
    static byte ct[114], tag[16], dec[114];
    int r;

