yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    r = wc_ChaCha20Poly1305_Encrypt(key, iv, aad, sizeof(aad),
            pt, sizeof(pt), ct, tag);
    printf("ChaCha20-Poly1305 encrypt: %s (r=%d)\r\n",
        (r == 0 && XMEMCMP(ct, ct0, 4) == 0 &&
         XMEMCMP(tag, tag_exp, 16) == 0) ? "PASS":"FAIL", r);
    r = wc_ChaCha20Poly1305_Decrypt(key, iv, aad, sizeof(aad),
            ct, sizeof(ct), tag, dec);
    printf("ChaCha20-Poly1305 decrypt+verify: %s (r=%d)\r\n",
        (r == 0 && XMEMCMP(dec, pt, sizeof(pt)) == 0) ? "PASS":"FAIL", r);
}
#endif /* WOLF_CHACHA */

#ifdef WOLF_AESEXTRA
static void wolf_aes_cmac_ccm_test(void)
{
    /* AES-128-CMAC (NIST SP800-38B example, 16-byte message). */
    static const byte ck[16] = {
        0x2b,0x7e,0x15,0x16,0x28,0xae,0xd2,0xa6,
        0xab,0xf7,0x15,0x88,0x09,0xcf,0x4f,0x3c};
    static const byte cmsg[16] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a};
    static const byte cmac_exp[16] = {
        0x07,0x0a,0x16,0xb4,0x6b,0x4d,0x41,0x44,
        0xf7,0x9b,0xdd,0x9d,0xd0,0x4a,0x28,0x7c};
    /* AES-128-CCM (RFC 3610 packet vector #1). */
    static const byte ek[16] = {
        0xc0,0xc1,0xc2,0xc3,0xc4,0xc5,0xc6,0xc7,
        0xc8,0xc9,0xca,0xcb,0xcc,0xcd,0xce,0xcf};
    static const byte enonce[13] = {
        0x00,0x00,0x00,0x03,0x02,0x01,0x00,0xa0,0xa1,0xa2,0xa3,0xa4,0xa5};
    static const byte eaad[8] = {0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07};
    static const byte ept[23] = {
        0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f,0x10,0x11,0x12,0x13,
        0x14,0x15,0x16,0x17,0x18,0x19,0x1a,0x1b,0x1c,0x1d,0x1e};
    static const byte ect_exp[23] = {
        0x58,0x8c,0x97,0x9a,0x61,0xc6,0x63,0xd2,0xf0,0x66,0xd0,0xc2,
        0xc0,0xf9,0x89,0x80,0x6d,0x5f,0x6b,0x61,0xda,0xc3,0x84};
    static const byte etag_exp[8] = {
        0x17,0xe8,0xd1,0x2c,0xfd,0xf9,0x26,0xe0};
    static Aes aes;
    byte mac[16], cct[23], ctag[8], cdec[23];
    word32 macSz = sizeof(mac);
    int r;

    r = wc_AesCmacGenerate(mac, &macSz, cmsg, sizeof(cmsg), ck, sizeof(ck));
    printf("AES-128-CMAC:  %s\r\n",
        (r == 0 && macSz == 16 && XMEMCMP(mac, cmac_exp, 16) == 0) ?
        "PASS":"FAIL");

    r = wc_AesInit(&aes, NULL, INVALID_DEVID);
    if (r == 0) r = wc_AesCcmSetKey(&aes, ek, sizeof(ek));
    if (r == 0) r = wc_AesCcmEncrypt(&aes, cct, ept, sizeof(ept),
        enonce, sizeof(enonce), ctag, sizeof(ctag), eaad, sizeof(eaad));
    printf("AES-128-CCM encrypt: %s\r\n",
        (r == 0 && XMEMCMP(cct, ect_exp, 23) == 0 &&
         XMEMCMP(ctag, etag_exp, 8) == 0) ? "PASS":"FAIL");
    r = wc_AesCcmDecrypt(&aes, cdec, ect_exp, sizeof(ect_exp),
        enonce, sizeof(enonce), etag_exp, sizeof(etag_exp), eaad, sizeof(eaad));
    printf("AES-128-CCM decrypt+verify: %s\r\n",
        (r == 0 && XMEMCMP(cdec, ept, sizeof(ept)) == 0) ? "PASS":"FAIL");
    wc_AesFree(&aes);

}

/* GMAC = AES-GCM authentication of AAD with no plaintext.  Self-consistent:
 * generate then verify (KAT-cross-checked on host). */
static void wolf_aes_gmac_test(void)
{
    static const byte gk[16] = {
        0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47,
        0x48,0x49,0x4a,0x4b,0x4c,0x4d,0x4e,0x4f};
    static const byte giv[12] = {
        0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1a,0x1b};
    static const byte gaad[16] = {
        0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,
        0x28,0x29,0x2a,0x2b,0x2c,0x2d,0x2e,0x2f};
    static Aes aes;
    byte gtag[16];
    int r;

    r = wc_AesInit(&aes, NULL, INVALID_DEVID);
    if (r == 0) r = wc_AesGcmSetKey(&aes, gk, sizeof(gk));
    if (r == 0) r = wc_AesGcmEncrypt(&aes, NULL, NULL, 0, giv,
        sizeof(giv), gtag, sizeof(gtag), gaad, sizeof(gaad));
    if (r == 0) r = wc_AesGcmDecrypt(&aes, NULL, NULL, 0, giv,
        sizeof(giv), gtag, sizeof(gtag), gaad, sizeof(gaad));
    printf("AES-128-GMAC (gen+verify): %s\r\n", (r == 0) ? "PASS":"FAIL");
    wc_AesFree(&aes);
}
#endif /* WOLF_AESEXTRA */

#ifdef WOLF_AESEXTRA
/* Extra AES modes - self-consistent encrypt/decrypt round-trips. */
static void wolf_aes_modes_test(void)
{
    static const byte mk[32] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f,
        0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1a,0x1b,0x1c,0x1d,0x1e,0x1f};
    static const byte mpt[32] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a,
        0xae,0x2d,0x8a,0x57,0x1e,0x03,0xac,0x9c,0x9e,0xb7,0x6f,0xac,0x45,0xaf,0x8e,0x51};
    static const byte miv[16] = {
        0xf0,0xf1,0xf2,0xf3,0xf4,0xf5,0xf6,0xf7,0xf8,0xf9,0xfa,0xfb,0xfc,0xfd,0xfe,0xff};
    static byte mct[32], mdec[32];
    int r;
#ifdef WOLFSSL_AES_OFB
    {
        static Aes oaes;
        r = wc_AesInit(&oaes, NULL, INVALID_DEVID);
        if (r == 0) r = wc_AesSetKey(&oaes, mk, 16, miv, AES_ENCRYPTION);
        if (r == 0) r = wc_AesOfbEncrypt(&oaes, mct, mpt, 32);
        if (r == 0) r = wc_AesSetKey(&oaes, mk, 16, miv, AES_ENCRYPTION);
        if (r == 0) r = wc_AesOfbDecrypt(&oaes, mdec, mct, 32);
        printf("AES-128-OFB round-trip: %s (ret=%d)\r\n",
            (r == 0 && XMEMCMP(mdec, mpt, 32) == 0) ? "PASS":"FAIL", r);
        wc_AesFree(&oaes);
    }
#endif
#ifdef WOLFSSL_AES_XTS
    {
        static XtsAes xaes;
        r = wc_AesXtsSetKey(&xaes, mk, 32, AES_ENCRYPTION, NULL, INVALID_DEVID);
        if (r == 0) r = wc_AesXtsEncrypt(&xaes, mct, mpt, 32, miv, 16);
        if (r == 0) r = wc_AesXtsSetKey(&xaes, mk, 32, AES_DECRYPTION, NULL, INVALID_DEVID);
        if (r == 0) r = wc_AesXtsDecrypt(&xaes, mdec, mct, 32, miv, 16);
        printf("AES-128-XTS round-trip: %s\r\n",
            (r == 0 && XMEMCMP(mdec, mpt, 32) == 0) ? "PASS":"FAIL");
        wc_AesXtsFree(&xaes);
    }
#endif
#ifdef WOLFSSL_AES_SIV
    {
        static byte siv[16];
        r = wc_AesSivEncrypt(mk, 32, NULL, 0, miv, 16, mpt, 32, siv, mct);
        if (r == 0) r = wc_AesSivDecrypt(mk, 32, NULL, 0, miv, 16, mct, 32, siv, mdec);
        printf("AES-256-SIV round-trip: %s\r\n",
            (r == 0 && XMEMCMP(mdec, mpt, 32) == 0) ? "PASS":"FAIL");
    }
#endif
#ifdef WOLFSSL_AES_EAX
    {
        static byte etag[16];
        /* one-shot EAX requires a non-NULL authIn pointer; use a 4-byte AAD */
        r = wc_AesEaxEncryptAuth(mk, 16, mct, mpt, 32, miv, 16, etag, 16, miv, 4);
        if (r == 0) r = wc_AesEaxDecryptAuth(mk, 16, mdec, mct, 32, miv, 16,
            etag, 16, miv, 4);
        printf("AES-128-EAX round-trip: %s\r\n",
            (r == 0 && XMEMCMP(mdec, mpt, 32) == 0) ? "PASS":"FAIL");
    }
#endif
}
#endif /* WOLF_AESEXTRA */

#ifdef WOLF_RSA
static void wolf_rsa_verify_test(void)
{
    /* Recover the PKCS#1 v1.5 DigestInfo from the signature with the public
     * key and compare to the expected DigestInfo (SHA-256 prefix + hash). */
    static RsaKey rsaKey;
    /* In RSA_VERIFY_ONLY / SP_NO_MALLOC builds wc_RsaSSL_Verify runs the
     * modexp in place in the caller's buffer, so it must be at least the
     * key size (256 B for RSA-2048), not just the recovered DigestInfo. */
    byte out[256];
    int r, outLen = -1;

    r = wc_InitRsaKey(&rsaKey, NULL);
    if (r == 0) r = wc_RsaPublicKeyDecodeRaw(kat_rsa2048_n,
        (word32)sizeof(kat_rsa2048_n), kat_rsa2048_e,
        (word32)sizeof(kat_rsa2048_e), &rsaKey);
    if (r == 0) outLen = wc_RsaSSL_Verify(kat_rsa2048_sig,
        (word32)sizeof(kat_rsa2048_sig), out, (word32)sizeof(out), &rsaKey);
    printf("RSA-2048 verify: %s (recovered=%d exp=%d)\r\n",
        (outLen == (int)sizeof(kat_rsa2048_digestinfo) &&
         XMEMCMP(out, kat_rsa2048_digestinfo,
                 sizeof(kat_rsa2048_digestinfo)) == 0) ? "PASS":"FAIL",
        outLen, (int)sizeof(kat_rsa2048_digestinfo));
    wc_FreeRsaKey(&rsaKey);
}
#endif /* WOLF_RSA */

#ifdef WOLF_DH
static void wolf_dh_test(void)
{
    /* Deterministic (no RNG) self-consistency: with two fixed private
     * exponents a,b and the FFDHE-2048 generator g, derive pubA=g^a and
     * pubB=g^b (wc_DhAgree computes otherPub^priv mod p), then check
     * pubB^a == pubA^b == g^(ab). */
    static DhKey dh;
    static const byte privA[32] = {
        0x3a,0x1f,0x9c,0x42,0x77,0x05,0xe8,0xb3,0x11,0x6d,0x24,0x8f,0x90,0xcc,0x53,0x2e,
        0x84,0x19,0xbd,0x60,0x7a,0xf2,0x0c,0x95,0x38,0xd1,0x4b,0xe6,0x22,0x7f,0xa3,0x5d};
    static const byte privB[32] = {
        0xc4,0x82,0x6b,0x1d,0x59,0xee,0x30,0x97,0xab,0x40,0x12,0x7e,0xf5,0x68,0x0b,0xd9,
        0x2c,0x71,0x86,0x4f,0x03,0x9a,0xe1,0x55,0xb8,0x27,0x6c,0x90,0x44,0xdf,0x18,0x63};
    static byte pubA[256], pubB[256], secA[256], secB[256];
    const DhParams* p = wc_Dh_ffdhe2048_Get();
    word32 pubASz = sizeof(pubA), pubBSz = sizeof(pubB);
    word32 secASz = sizeof(secA), secBSz = sizeof(secB);
    int r = wc_InitDhKey(&dh);
    if (r == 0)
        r = wc_DhSetKey(&dh, p->p, p->p_len, p->g, p->g_len);
    if (r == 0)
        r = wc_DhAgree(&dh, pubA, &pubASz, privA, sizeof(privA), p->g, p->g_len);
    if (r == 0)
        r = wc_DhAgree(&dh, pubB, &pubBSz, privB, sizeof(privB), p->g, p->g_len);
    if (r == 0)
        r = wc_DhAgree(&dh, secA, &secASz, privA, sizeof(privA), pubB, pubBSz);
    if (r == 0)
        r = wc_DhAgree(&dh, secB, &secBSz, privB, sizeof(privB), pubA, pubASz);
    printf("DH FFDHE-2048 agree: %s (r=%d lenA=%lu lenB=%lu)\r\n",
        (r == 0 && secASz == secBSz && secASz > 0 &&
         XMEMCMP(secA, secB, secASz) == 0) ? "PASS":"FAIL",
        r, (unsigned long)secASz, (unsigned long)secBSz);
    wc_FreeDhKey(&dh);
}
#endif /* WOLF_DH */

