yota22721/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
#ifdef WOLF_RSASIGN
static void wolf_rsa_sign_test(void)
{
    /* Import a fixed raw private key, sign a 32-byte payload, then verify
     * with the public part and check the recovered payload (self-consistent
     * - exercises the SP private CRT path).  rkey and the 256-cell buffers are
     * static (.bss), not stack: under WOLFSSL_SP_NO_MALLOC RsaKey carries the
     * modexp workspace, which the 16 KW C28x stack cannot absorb. */
    static RsaKey rkey;
    static const byte rs_in[32] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f,
        0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1a,0x1b,0x1c,0x1d,0x1e,0x1f};
    static byte rs_sig[256];
    static byte rs_out[256];
    word32 rs_sigLen = (word32)sizeof(rs_sig);
    int r, sl, vlen = -1;

    r = wc_InitRsaKey(&rkey, NULL);
    if (r == 0) {
        r = wc_RsaPrivateKeyDecodeRaw(
            kat_rsapriv_n, (word32)sizeof(kat_rsapriv_n),
            kat_rsapriv_e, (word32)sizeof(kat_rsapriv_e),
            kat_rsapriv_d, (word32)sizeof(kat_rsapriv_d),
            kat_rsapriv_u, (word32)sizeof(kat_rsapriv_u),
            kat_rsapriv_p, (word32)sizeof(kat_rsapriv_p),
            kat_rsapriv_q, (word32)sizeof(kat_rsapriv_q),
            kat_rsapriv_dP, (word32)sizeof(kat_rsapriv_dP),
            kat_rsapriv_dQ, (word32)sizeof(kat_rsapriv_dQ), &rkey);
    }
    if (r == 0) {
        sl = wc_RsaSSL_Sign(rs_in, (word32)sizeof(rs_in), rs_sig, rs_sigLen,
            &rkey, NULL);
        if (sl > 0) { rs_sigLen = (word32)sl; } else { r = sl; }
    }
    if (r == 0) {
        vlen = wc_RsaSSL_Verify(rs_sig, rs_sigLen, rs_out,
            (word32)sizeof(rs_out), &rkey);
    }
    printf("RSA-2048 sign/verify round-trip: %s (sigLen=%lu vlen=%d)\r\n",
        (r == 0 && vlen == (int)sizeof(rs_in) &&
         XMEMCMP(rs_out, rs_in, sizeof(rs_in)) == 0) ? "PASS":"FAIL",
        (unsigned long)rs_sigLen, vlen);
    wc_FreeRsaKey(&rkey);
}
#endif /* WOLF_RSASIGN */

/* ------------------------------------------------------------------------- */
/* main                                                                      */
/* ------------------------------------------------------------------------- */
int main(void)
{
#ifndef NO_CRYPT_TEST
    wc_test_ret_t test_ret;
#endif
#ifndef NO_CRYPT_BENCHMARK
    int bench_ret;
#endif

    /* PLL to 150 MHz, flash wait states, disable watchdog, enable clocks. */
    Device_init();
    Device_initGPIO();
    c2000_sciInit();
#ifdef WOLF_C2000_SCI_STDOUT
    c2000_stdoutToSci();
#endif
    c2000_timerInit();

    /* Unbuffered stdout so output appears immediately and survives a crash,
     * whether routed to SCIA or the CCS console (CIO). */
    setvbuf(stdout, NULL, _IONBF, 0);

    printf("\r\n");
    printf("=== wolfSSL wolfCrypt on TI C2000 LAUNCHXL-F28P55X ===\r\n");

#ifdef WOLF_ENTROPY_PROBE
    /* Measurement-only image: dump raw entropy samples and stop.  Nothing
     * after this runs, which is why the Makefile rejects combining
     * ENTROPY_PROBE=1 with the other image toggles. */
    entropy_probe_run();
    for (;;) {
        /* spin */
    }
#endif

#ifdef WOLF_MEM_PROFILE
    /* Route XMALLOC/XFREE/XREALLOC through the heap high-water tracker. */
    wolf_mem_install();
#endif

#ifdef WOLF_HWAES
    /* wolfCrypt_Init() is mandatory first: it sets every device-table slot to
     * INVALID_DEVID, and RegisterDevice only claims a slot marked that way.
     * Without it the table is BSS-zero and registration fails with BUFFER_E. */
    if (wolfCrypt_Init() != 0) {
        printf("wolfCrypt_Init: FAIL\r\n");
    }
    else if (wc_C2000_Init(WOLFSSL_C2000_DEVID) != 0) {
        printf("C2000 AESA init: FAIL\r\n");
    }
    else {
        printf("C2000 AESA init: PASS\r\n");
        g_aesaReady = 1;
    }
#endif

    wolf_sha3_256_test();
    wolf_sha256_test();
    wolf_shake256_test();
#ifndef WOLF_MLDSA_SIGN
    wolf_shake256_large_test();
#endif
    wolf_sha512_test();
#ifdef WOLF_SHA1
    wolf_sha1_test();
#endif

#ifdef WOLF_SECUREBOOT
    printf("\r\n--- Pure-mode ML-DSA secure boot ---\r\n");
    wolf_secureboot_test();
#elif defined(WOLF_MLDSA_OCTETS)
    printf("\r\n--- ML-DSA octet boundary (44/65/87, pre-hash, packed) ---\r\n");
    wolf_mldsa_octet_test();
#elif !defined(WOLF_MLDSA_SIGN)
    wolf_mldsa87_verify_test();
#else
    wolf_mldsa87_sign_test();
#ifndef WOLFSSL_NO_ML_DSA_44
    mldsa_sign_roundtrip(WC_ML_DSA_44, "ML-DSA-44");
#endif
#ifndef WOLFSSL_NO_ML_DSA_65
    mldsa_sign_roundtrip(WC_ML_DSA_65, "ML-DSA-65");
#endif
#endif /* ML-DSA test selection */

#ifdef WOLF_ECC
    printf("\r\n--- ECDSA/ECDH P-256 (SP) ---\r\n");
    wolf_ecc_test();
#endif

#ifdef WOLF_MLKEM
    printf("\r\n--- ML-KEM-768 ---\r\n");
    wolf_mlkem768_test();
#ifndef WOLFSSL_NO_ML_KEM_512
    (void)mlkem_roundtrip(WC_ML_KEM_512, "ML-KEM-512");
#endif
#ifndef WOLFSSL_NO_ML_KEM_1024
    (void)mlkem_roundtrip(WC_ML_KEM_1024, "ML-KEM-1024");
#endif
#endif /* WOLF_MLKEM */

#ifdef WOLF_ENTROPY
    printf("\r\n--- Entropy (oscillator jitter) ---\r\n");
    wolf_entropy_test();
#endif /* WOLF_ENTROPY */

#ifdef WOLF_AES
    printf("\r\n--- AES (CBC/CTR/CFB/GCM) ---\r\n");
    wolf_aes_test();
#endif /* WOLF_AES */

#ifdef WOLF_HWAES
    printf("\r\n--- AES hardware (AESA) vs software ---\r\n");
    wolf_aes_hw_test();
#endif /* WOLF_HWAES */

#ifdef WOLF_25519
    printf("\r\n--- Curve25519 (X25519) + Ed25519 ---\r\n");
    wolf_curve25519_test();
#endif /* WOLF_25519 */

#ifdef WOLF_448
    printf("\r\n--- Curve448 (X448) + Ed448 ---\r\n");
    wolf_curve448_test();
#endif /* WOLF_448 */

#ifdef WOLF_HKDF
    printf("\r\n--- HMAC-SHA256 + HKDF-SHA256 ---\r\n");
    wolf_hkdf_test();
#endif /* WOLF_HKDF */

#ifdef WOLF_CHACHA
    printf("\r\n--- ChaCha20-Poly1305 AEAD (RFC 8439) ---\r\n");
    wolf_poly1305_test();
    wolf_chacha20_poly1305_test();
#endif /* WOLF_CHACHA */

#ifdef WOLF_AESEXTRA
    printf("\r\n--- AES-CMAC / CCM / GMAC ---\r\n");
    wolf_aes_cmac_ccm_test();
    wolf_aes_gmac_test();
    wolf_aes_modes_test();
#endif /* WOLF_AESEXTRA */

#ifdef WOLF_RSA
    printf("\r\n--- RSA-2048 verify (PKCS#1 v1.5, SHA-256) ---\r\n");
    wolf_rsa_verify_test();
#endif /* WOLF_RSA */

#ifdef WOLF_DH
    printf("\r\n--- DH (FFDHE-2048) ---\r\n");
    wolf_dh_test();
#endif /* WOLF_DH */

#ifdef WOLF_RSASIGN
    printf("\r\n--- RSA-2048 sign (PKCS#1 v1.5, SP private/CRT) ---\r\n");
    wolf_rsa_sign_test();
#endif /* WOLF_RSASIGN */

    printf("SYSCLK %lu Hz, CHAR_BIT %d, sizeof(long)=%d sizeof(long long)=%d\r\n",
           (unsigned long)DEVICE_SYSCLK_FREQ, (int)CHAR_BIT,
           (int)sizeof(long), (int)sizeof(long long));

#ifndef NO_CRYPT_TEST
    printf("\r\n--- wolfcrypt_test ---\r\n");
    test_ret = wolfcrypt_test(NULL);
    printf("wolfcrypt_test result: %ld\r\n", (long)test_ret);
#endif

#ifndef NO_CRYPT_BENCHMARK
    g_logpos = 0; /* reset capture so the full benchmark fits the JTAG log */
    printf("\r\n--- benchmark_test ---\r\n");
    bench_ret = benchmark_test(NULL);
    printf("benchmark_test result: %d\r\n", bench_ret);
#endif

    printf("\r\n=== done ===\r\n");

    for (;;) {
        /* spin */
    }
}
